mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/common/s6e2d5xj.h
typedef struct stc_canfd_ir_field
{
        __IO  uint32_t  RF0N                     :1;
        __IO  uint32_t  RF0W                     :1;
        __IO  uint32_t  RF0F                     :1;
        __IO  uint32_t  RF0L                     :1;
        __IO  uint32_t  RF1N                     :1;
        __IO  uint32_t  RF1W                     :1;
        __IO  uint32_t  RF1F                     :1;
        __IO  uint32_t  RF1L                     :1;
        __IO  uint32_t  HPM                      :1;
        __IO  uint32_t  TC                       :1;
        __IO  uint32_t  TCF                      :1;
        __IO  uint32_t  TFE                      :1;
        __IO  uint32_t  TEFN                     :1;
        __IO  uint32_t  TEFW                     :1;
        __IO  uint32_t  TEFF                     :1;
        __IO  uint32_t  TEFL                     :1;
        __IO  uint32_t  TSW                      :1;
        __IO  uint32_t  MRAF                     :1;
        __IO  uint32_t  TOO                      :1;
        __IO  uint32_t  DRX                      :1;
        __IO  uint32_t  BEC                      :1;
        __IO  uint32_t  BEU                      :1;
        __IO  uint32_t  ELO                      :1;
        __IO  uint32_t  EP                       :1;
        __IO  uint32_t  EW                       :1;
        __IO  uint32_t  BO                       :1;
        __IO  uint32_t  WDI                      :1;
        __IO  uint32_t  CRCE                     :1;
        __IO  uint32_t  BE                       :1;
        __IO  uint32_t  ACKE                     :1;
        __IO  uint32_t  FOE                      :1;
        __IO  uint32_t  STE                      :1;
} stc_canfd_ir_field_t;

typedef struct stc_canfd_ie_field
{
        __IO  uint32_t  RF0NE                    :1;
        __IO  uint32_t  RF0WE                    :1;
        __IO  uint32_t  RF0FE                    :1;
        __IO  uint32_t  RF0LE                    :1;
        __IO  uint32_t  RF1NE                    :1;
        __IO  uint32_t  RF1WE                    :1;
        __IO  uint32_t  RF1FE                    :1;
        __IO  uint32_t  RF1LE                    :1;
        __IO  uint32_t  HPME                     :1;
        __IO  uint32_t  TCE                      :1;
        __IO  uint32_t  TCFE                     :1;
        __IO  uint32_t  TFEE                     :1;
        __IO  uint32_t  TEFNE                    :1;
        __IO  uint32_t  TEFWE                    :1;
        __IO  uint32_t  TEFFE                    :1;
        __IO  uint32_t  TEFLE                    :1;
        __IO  uint32_t  TSWE                     :1;
        __IO  uint32_t  MRAFE                    :1;
        __IO  uint32_t  TOOE                     :1;
        __IO  uint32_t  DRXE                     :1;
        __IO  uint32_t  BECE                     :1;
        __IO  uint32_t  BEUE                     :1;
        __IO  uint32_t  ELOE                     :1;
        __IO  uint32_t  EPE                      :1;
        __IO  uint32_t  EWE                      :1;
        __IO  uint32_t  BOE                      :1;
        __IO  uint32_t  WDIE                     :1;
        __IO  uint32_t  CRCEE                    :1;
        __IO  uint32_t  BEE                      :1;
        __IO  uint32_t  ACKEE                    :1;
        __IO  uint32_t  FOEE                     :1;
        __IO  uint32_t  STEE                     :1;
} stc_canfd_ie_field_t;

typedef struct stc_canfd_ils_field
{
        __IO  uint32_t  RF0NL                    :1;
        __IO  uint32_t  RF0WL                    :1;
        __IO  uint32_t  RF0FL                    :1;
        __IO  uint32_t  RF0LL                    :1;
        __IO  uint32_t  RF1NL                    :1;
        __IO  uint32_t  RF1WL                    :1;
        __IO  uint32_t  RF1FL                    :1;
        __IO  uint32_t  RF1LL                    :1;
        __IO  uint32_t  HPML                     :1;
        __IO  uint32_t  TCL                      :1;
        __IO  uint32_t  TCFL                     :1;
        __IO  uint32_t  TFEL                     :1;
        __IO  uint32_t  TEFNL                    :1;
        __IO  uint32_t  TEFWL                    :1;
        __IO  uint32_t  TEFFL                    :1;
        __IO  uint32_t  TEFLL                    :1;
        __IO  uint32_t  TSWL                     :1;
        __IO  uint32_t  MRAFL                    :1;
        __IO  uint32_t  TOOL                     :1;
        __IO  uint32_t  DRXL                     :1;
        __IO  uint32_t  BECL                     :1;
        __IO  uint32_t  BEUL                     :1;
        __IO  uint32_t  ELOL                     :1;
        __IO  uint32_t  EPL                      :1;
        __IO  uint32_t  EWL                      :1;
        __IO  uint32_t  BOL                      :1;
        __IO  uint32_t  WDIL                     :1;
        __IO  uint32_t  CRCEL                    :1;
        __IO  uint32_t  BEL                      :1;
        __IO  uint32_t  ACKEL                    :1;
        __IO  uint32_t  FOEL                     :1;
        __IO  uint32_t  STEL                     :1;
} stc_canfd_ils_field_t;

typedef struct stc_canfd_ile_field
{
        __IO  uint32_t  EINT0                    :1;
        __IO  uint32_t  EINT1                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_canfd_ile_field_t;

typedef struct stc_canfd_gfc_field
{
    union {
        struct {
            __IO  uint32_t  RRFE                 :1;
            __IO  uint32_t  RRFS                 :1;
            __IO  uint32_t  ANFE                 :2;
            __IO  uint32_t  ANFS                 :2;
            __IO  uint32_t  RESERVED1            :26;
        };
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  ANFE0                :1;
            __IO  uint32_t  ANFE1                :1;
            __IO  uint32_t  ANFS0                :1;
            __IO  uint32_t  ANFS1                :1;
            __IO  uint32_t  RESERVED2            :26;
        };
    };
} stc_canfd_gfc_field_t;

