mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/common/s6e2d5xj.h
typedef struct stc_canfd_rxf0a_field
{
    union {
        struct {
            __IO  uint32_t  F0AI                 :6;
            __IO  uint32_t  RESERVED0            :26;
        };
        struct {
            __IO  uint32_t  F0AI0                :1;
            __IO  uint32_t  F0AI1                :1;
            __IO  uint32_t  F0AI2                :1;
            __IO  uint32_t  F0AI3                :1;
            __IO  uint32_t  F0AI4                :1;
            __IO  uint32_t  F0AI5                :1;
            __IO  uint32_t  RESERVED1            :26;
        };
    };
} stc_canfd_rxf0a_field_t;

typedef struct stc_canfd_rxbc_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  RBSA                 :14;
            __IO  uint32_t  RESERVED2            :16;
        };
        struct {
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  RBSA0                :1;
            __IO  uint32_t  RBSA1                :1;
            __IO  uint32_t  RBSA2                :1;
            __IO  uint32_t  RBSA3                :1;
            __IO  uint32_t  RBSA4                :1;
            __IO  uint32_t  RBSA5                :1;
            __IO  uint32_t  RBSA6                :1;
            __IO  uint32_t  RBSA7                :1;
            __IO  uint32_t  RBSA8                :1;
            __IO  uint32_t  RBSA9                :1;
            __IO  uint32_t  RBSA10               :1;
            __IO  uint32_t  RBSA11               :1;
            __IO  uint32_t  RBSA12               :1;
            __IO  uint32_t  RBSA13               :1;
            __IO  uint32_t  RESERVED3            :16;
        };
    };
} stc_canfd_rxbc_field_t;

typedef struct stc_canfd_rxf1c_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  F1SA                 :14;
            __IO  uint32_t  F1S                  :7;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  F1WM                 :7;
            __IO  uint32_t  F1OM                 :1;
        };
        struct {
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  F1SA0                :1;
            __IO  uint32_t  F1SA1                :1;
            __IO  uint32_t  F1SA2                :1;
            __IO  uint32_t  F1SA3                :1;
            __IO  uint32_t  F1SA4                :1;
            __IO  uint32_t  F1SA5                :1;
            __IO  uint32_t  F1SA6                :1;
            __IO  uint32_t  F1SA7                :1;
            __IO  uint32_t  F1SA8                :1;
            __IO  uint32_t  F1SA9                :1;
            __IO  uint32_t  F1SA10               :1;
            __IO  uint32_t  F1SA11               :1;
            __IO  uint32_t  F1SA12               :1;
            __IO  uint32_t  F1SA13               :1;
            __IO  uint32_t  F1S0                 :1;
            __IO  uint32_t  F1S1                 :1;
            __IO  uint32_t  F1S2                 :1;
            __IO  uint32_t  F1S3                 :1;
            __IO  uint32_t  F1S4                 :1;
            __IO  uint32_t  F1S5                 :1;
            __IO  uint32_t  F1S6                 :1;
            __IO  uint32_t  RESERVED3            :1;
            __IO  uint32_t  F1WM0                :1;
            __IO  uint32_t  F1WM1                :1;
            __IO  uint32_t  F1WM2                :1;
            __IO  uint32_t  F1WM3                :1;
            __IO  uint32_t  F1WM4                :1;
            __IO  uint32_t  F1WM5                :1;
            __IO  uint32_t  F1WM6                :1;
            __IO  uint32_t  RESERVED4            :1;
        };
    };
} stc_canfd_rxf1c_field_t;

typedef struct stc_canfd_rxf1s_field
{
    union {
        struct {
            __IO  uint32_t  F1FL                 :7;
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  F1GI                 :6;
            __IO  uint32_t  RESERVED2            :2;
            __IO  uint32_t  F1PI                 :6;
            __IO  uint32_t  RESERVED4            :2;
            __IO  uint32_t  F1F                  :1;
            __IO  uint32_t  RF1L                 :1;
            __IO  uint32_t  RESERVED5            :4;
            __IO  uint32_t  DMS                  :2;
        };
        struct {
            __IO  uint32_t  F1FL0                :1;
            __IO  uint32_t  F1FL1                :1;
            __IO  uint32_t  F1FL2                :1;
            __IO  uint32_t  F1FL3                :1;
            __IO  uint32_t  F1FL4                :1;
            __IO  uint32_t  F1FL5                :1;
            __IO  uint32_t  F1FL6                :1;
            __IO  uint32_t  RESERVED1            :1;
            __IO  uint32_t  F1GI0                :1;
            __IO  uint32_t  F1GI1                :1;
            __IO  uint32_t  F1GI2                :1;
            __IO  uint32_t  F1GI3                :1;
            __IO  uint32_t  F1GI4                :1;
            __IO  uint32_t  F1GI5                :1;
            __IO  uint32_t  RESERVED3            :2;
            __IO  uint32_t  F1PI0                :1;
            __IO  uint32_t  F1PI1                :1;
            __IO  uint32_t  F1PI2                :1;
            __IO  uint32_t  F1PI3                :1;
            __IO  uint32_t  F1PI4                :1;
            __IO  uint32_t  F1PI5                :1;
            __IO  uint32_t  RESERVED6            :8;
            __IO  uint32_t  DMS0                 :1;
            __IO  uint32_t  DMS1                 :1;
        };
    };
} stc_canfd_rxf1s_field_t;

typedef struct stc_canfd_rxf1a_field
{
    union {
        struct {
            __IO  uint32_t  F1AI                 :6;
            __IO  uint32_t  RESERVED0            :26;
        };
        struct {
            __IO  uint32_t  F1AI0                :1;
            __IO  uint32_t  F1AI1                :1;
            __IO  uint32_t  F1AI2                :1;
            __IO  uint32_t  F1AI3                :1;
            __IO  uint32_t  F1AI4                :1;
            __IO  uint32_t  F1AI5                :1;
            __IO  uint32_t  RESERVED1            :26;
        };
    };
} stc_canfd_rxf1a_field_t;

typedef struct stc_canfd_rxesc_field
{
    union {
        struct {
            __IO  uint32_t  F0DS                 :3;
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  F1DS                 :3;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  RBDS                 :3;
            __IO  uint32_t  RESERVED4            :21;
        };
        struct {
            __IO  uint32_t  F0DS0                :1;
            __IO  uint32_t  F0DS1                :1;
            __IO  uint32_t  F0DS2                :1;
            __IO  uint32_t  RESERVED1            :1;
            __IO  uint32_t  F1DS0                :1;
            __IO  uint32_t  F1DS1                :1;
            __IO  uint32_t  F1DS2                :1;
            __IO  uint32_t  RESERVED3            :1;
            __IO  uint32_t  RBDS0                :1;
            __IO  uint32_t  RBDS1                :1;
            __IO  uint32_t  RBDS2                :1;
            __IO  uint32_t  RESERVED5            :21;
        };
    };
} stc_canfd_rxesc_field_t;

typedef struct stc_canfd_txbc_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  TBSA                 :14;
            __IO  uint32_t  NDTB                 :6;
            __IO  uint32_t  RESERVED2            :2;
            __IO  uint32_t  TFQS                 :6;
            __IO  uint32_t  TFQM                 :1;
            __IO  uint32_t  RESERVED4            :1;
        };
        struct {
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  TBSA0                :1;
            __IO  uint32_t  TBSA1                :1;
            __IO  uint32_t  TBSA2                :1;
            __IO  uint32_t  TBSA3                :1;
            __IO  uint32_t  TBSA4                :1;
            __IO  uint32_t  TBSA5                :1;
            __IO  uint32_t  TBSA6                :1;
            __IO  uint32_t  TBSA7                :1;
            __IO  uint32_t  TBSA8                :1;
            __IO  uint32_t  TBSA9                :1;
            __IO  uint32_t  TBSA10               :1;
            __IO  uint32_t  TBSA11               :1;
            __IO  uint32_t  TBSA12               :1;
            __IO  uint32_t  TBSA13               :1;
            __IO  uint32_t  NDTB0                :1;
            __IO  uint32_t  NDTB1                :1;
            __IO  uint32_t  NDTB2                :1;
            __IO  uint32_t  NDTB3                :1;
            __IO  uint32_t  NDTB4                :1;
            __IO  uint32_t  NDTB5                :1;
            __IO  uint32_t  RESERVED3            :2;
            __IO  uint32_t  TFQS0                :1;
            __IO  uint32_t  TFQS1                :1;
            __IO  uint32_t  TFQS2                :1;
            __IO  uint32_t  TFQS3                :1;
            __IO  uint32_t  TFQS4                :1;
            __IO  uint32_t  TFQS5                :1;
            __IO  uint32_t  RESERVED5            :2;
        };
    };
} stc_canfd_txbc_field_t;

typedef struct stc_canfd_txfqs_field
{
    union {
        struct {
            __IO  uint32_t  TFFL                 :6;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  TFGI                 :5;
            __IO  uint32_t  RESERVED2            :3;
            __IO  uint32_t  TFQPI                :5;
            __IO  uint32_t  TFQF                 :1;
            __IO  uint32_t  RESERVED4            :10;
        };
        struct {
            __IO  uint32_t  TFFL0                :1;
            __IO  uint32_t  TFFL1                :1;
            __IO  uint32_t  TFFL2                :1;
            __IO  uint32_t  TFFL3                :1;
            __IO  uint32_t  TFFL4                :1;
            __IO  uint32_t  TFFL5                :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  TFGI0                :1;
            __IO  uint32_t  TFGI1                :1;
            __IO  uint32_t  TFGI2                :1;
            __IO  uint32_t  TFGI3                :1;
            __IO  uint32_t  TFGI4                :1;
            __IO  uint32_t  RESERVED3            :3;
            __IO  uint32_t  TFQPI0               :1;
            __IO  uint32_t  TFQPI1               :1;
            __IO  uint32_t  TFQPI2               :1;
            __IO  uint32_t  TFQPI3               :1;
            __IO  uint32_t  TFQPI4               :1;
            __IO  uint32_t  RESERVED5            :11;
        };
    };
} stc_canfd_txfqs_field_t;

typedef struct stc_canfd_txesc_field
{
    union {
        struct {
            __IO  uint32_t  TBDS                 :3;
            __IO  uint32_t  RESERVED0            :29;
        };
        struct {
            __IO  uint32_t  TBDS0                :1;
            __IO  uint32_t  TBDS1                :1;
            __IO  uint32_t  TBDS2                :1;
            __IO  uint32_t  RESERVED1            :29;
        };
    };
} stc_canfd_txesc_field_t;

typedef struct stc_canfd_txbrp_field
{
        __IO  uint32_t  TRP0                     :1;
        __IO  uint32_t  TRP1                     :1;
        __IO  uint32_t  TRP2                     :1;
        __IO  uint32_t  TRP3                     :1;
        __IO  uint32_t  TRP4                     :1;
        __IO  uint32_t  TRP5                     :1;
        __IO  uint32_t  TRP6                     :1;
        __IO  uint32_t  TRP7                     :1;
        __IO  uint32_t  TRP8                     :1;
        __IO  uint32_t  TRP9                     :1;
        __IO  uint32_t  TRP10                    :1;
        __IO  uint32_t  TRP11                    :1;
        __IO  uint32_t  TRP12                    :1;
        __IO  uint32_t  TRP13                    :1;
        __IO  uint32_t  TRP14                    :1;
        __IO  uint32_t  TRP15                    :1;
        __IO  uint32_t  TRP16                    :1;
        __IO  uint32_t  TRP17                    :1;
        __IO  uint32_t  TRP18                    :1;
        __IO  uint32_t  TRP19                    :1;
        __IO  uint32_t  TRP20                    :1;
        __IO  uint32_t  TRP21                    :1;
        __IO  uint32_t  TRP22                    :1;
        __IO  uint32_t  TRP23                    :1;
        __IO  uint32_t  TRP24                    :1;
        __IO  uint32_t  TRP25                    :1;
        __IO  uint32_t  TRP26                    :1;
        __IO  uint32_t  TRP27                    :1;
        __IO  uint32_t  TRP28                    :1;
        __IO  uint32_t  TRP29                    :1;
        __IO  uint32_t  TRP30                    :1;
        __IO  uint32_t  TRP31                    :1;
} stc_canfd_txbrp_field_t;

