mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/common/s6e2d5xj.h
/*******************************************************************************
* GDCPRE_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t GCCR;
        stc_gdcpre_gccr_field_t GCCR_f;
    };
        __IO  uint8_t RESERVED0[3];
    union {
        __IO  uint8_t GPCR1;
        stc_gdcpre_gpcr1_field_t GPCR1_f;
    };
        __IO  uint8_t RESERVED1[3];
    union {
        __IO  uint8_t GPCR2;
        stc_gdcpre_gpcr2_field_t GPCR2_f;
    };
        __IO  uint8_t RESERVED2[3];
    union {
        __IO  uint8_t GPCR3;
        stc_gdcpre_gpcr3_field_t GPCR3_f;
    };
        __IO  uint8_t RESERVED3[3];
    union {
        __IO  uint8_t GPCR4;
        stc_gdcpre_gpcr4_field_t GPCR4_f;
    };
        __IO  uint8_t RESERVED4[3];
    union {
        __IO  uint8_t GP_STR;
        stc_gdcpre_gp_str_field_t GP_STR_f;
    };
        __IO  uint8_t RESERVED5[3];
    union {
        __IO  uint8_t GPINT_ENR;
        stc_gdcpre_gpint_enr_field_t GPINT_ENR_f;
    };
        __IO  uint8_t RESERVED6[3];
    union {
        __IO  uint8_t GPINT_CLR;
        stc_gdcpre_gpint_clr_field_t GPINT_CLR_f;
    };
        __IO  uint8_t RESERVED7[3];
    union {
        __IO  uint8_t GPINT_STR;
        stc_gdcpre_gpint_str_field_t GPINT_STR_f;
    };
        __IO  uint8_t RESERVED8[7];
    union {
        __IO uint16_t GCSR;
        stc_gdcpre_gcsr_field_t GCSR_f;
        struct {
            __IO  uint8_t GCSRL;
            __IO  uint8_t GCSRH;
        };
    };
        __IO  uint8_t RESERVED9[2];
    union {
        __IO  uint8_t GRCR;
        stc_gdcpre_grcr_field_t GRCR_f;
    };
        __IO  uint8_t RESERVED10[3];
    union {
        __IO  uint8_t GMCR;
        stc_gdcpre_gmcr_field_t GMCR_f;
    };
} FM_GDCPRE_TypeDef, FM4_GDCPRE_TypeDef;

/*******************************************************************************
* GDCSUB_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t LOCKUNLOCK;
        stc_gdcsub_lockunlock_field_t LOCKUNLOCK_f;
        struct {
          union {
            __IO uint16_t LOCKUNLOCKL;
            struct {
              __IO uint8_t LOCKUNLOCKLL;
              __IO uint8_t LOCKUNLOCKLH;
            };
          };
          union {
            __IO uint16_t LOCKUNLOCKH;
            struct {
              __IO uint8_t LOCKUNLOCKHL;
              __IO uint8_t LOCKUNLOCKHH;
            };
          };
        };
    };
    union {
        __IO uint32_t LOCKSTATUS;
        stc_gdcsub_lockstatus_field_t LOCKSTATUS_f;
        struct {
          union {
            __IO uint16_t LOCKSTATUSL;
            struct {
              __IO uint8_t LOCKSTATUSLL;
              __IO uint8_t LOCKSTATUSLH;
            };
          };
          union {
            __IO uint16_t LOCKSTATUSH;
            struct {
              __IO uint8_t LOCKSTATUSHL;
              __IO uint8_t LOCKSTATUSHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[4];
    union {
        __IO uint32_t CONFIGCLOCKCONTROL;
        stc_gdcsub_configclockcontrol_field_t CONFIGCLOCKCONTROL_f;
        struct {
          union {
            __IO uint16_t CONFIGCLOCKCONTROLL;
            struct {
              __IO uint8_t CONFIGCLOCKCONTROLLL;
              __IO uint8_t CONFIGCLOCKCONTROLLH;
            };
          };
          union {
            __IO uint16_t CONFIGCLOCKCONTROLH;
            struct {
              __IO uint8_t CONFIGCLOCKCONTROLHL;
              __IO uint8_t CONFIGCLOCKCONTROLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t VRAMINTERRUPTENABLE;
        stc_gdcsub_vraminterruptenable_field_t VRAMINTERRUPTENABLE_f;
        struct {
          union {
            __IO uint16_t VRAMINTERRUPTENABLEL;
            struct {
              __IO uint8_t VRAMINTERRUPTENABLELL;
              __IO uint8_t VRAMINTERRUPTENABLELH;
            };
          };
          union {
            __IO uint16_t VRAMINTERRUPTENABLEH;
            struct {
              __IO uint8_t VRAMINTERRUPTENABLEHL;
              __IO uint8_t VRAMINTERRUPTENABLEHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[4];
    union {
        __IO uint32_t VRAMINTERRUPTCLEAR;
        stc_gdcsub_vraminterruptclear_field_t VRAMINTERRUPTCLEAR_f;
        struct {
          union {
            __IO uint16_t VRAMINTERRUPTCLEARL;
            struct {
              __IO uint8_t VRAMINTERRUPTCLEARLL;
              __IO uint8_t VRAMINTERRUPTCLEARLH;
            };
          };
          union {
            __IO uint16_t VRAMINTERRUPTCLEARH;
            struct {
              __IO uint8_t VRAMINTERRUPTCLEARHL;
              __IO uint8_t VRAMINTERRUPTCLEARHH;
            };
          };
        };
    };
    union {
        __IO uint32_t VRAMINTERRUPTSTATUS;
        stc_gdcsub_vraminterruptstatus_field_t VRAMINTERRUPTSTATUS_f;
        struct {
          union {
            __IO uint16_t VRAMINTERRUPTSTATUSL;
            struct {
              __IO uint8_t VRAMINTERRUPTSTATUSLL;
              __IO uint8_t VRAMINTERRUPTSTATUSLH;
            };
          };
          union {
            __IO uint16_t VRAMINTERRUPTSTATUSH;
            struct {
              __IO uint8_t VRAMINTERRUPTSTATUSHL;
              __IO uint8_t VRAMINTERRUPTSTATUSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t EXTFLASHDEVSELECT;
        stc_gdcsub_extflashdevselect_field_t EXTFLASHDEVSELECT_f;
        struct {
          union {
            __IO uint16_t EXTFLASHDEVSELECTL;
            struct {
              __IO uint8_t EXTFLASHDEVSELECTLL;
              __IO uint8_t EXTFLASHDEVSELECTLH;
            };
          };
          union {
            __IO uint16_t EXTFLASHDEVSELECTH;
            struct {
              __IO uint8_t EXTFLASHDEVSELECTHL;
              __IO uint8_t EXTFLASHDEVSELECTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t VRAMREMAPDISABLE;
        stc_gdcsub_vramremapdisable_field_t VRAMREMAPDISABLE_f;
        struct {
          union {
            __IO uint16_t VRAMREMAPDISABLEL;
            struct {
              __IO uint8_t VRAMREMAPDISABLELL;
              __IO uint8_t VRAMREMAPDISABLELH;
            };
          };
          union {
            __IO uint16_t VRAMREMAPDISABLEH;
            struct {
              __IO uint8_t VRAMREMAPDISABLEHL;
              __IO uint8_t VRAMREMAPDISABLEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PANICSWITCH;
        stc_gdcsub_panicswitch_field_t PANICSWITCH_f;
        struct {
          union {
            __IO uint16_t PANICSWITCHL;
            struct {
              __IO uint8_t PANICSWITCHLL;
              __IO uint8_t PANICSWITCHLH;
            };
          };
          union {
            __IO uint16_t PANICSWITCHH;
            struct {
              __IO uint8_t PANICSWITCHHL;
              __IO uint8_t PANICSWITCHHH;
            };
          };
        };
    };
    union {
        __IO uint32_t GDC_CLOCKDIVIDER;
        stc_gdcsub_gdc_clockdivider_field_t GDC_CLOCKDIVIDER_f;
        struct {
          union {
            __IO uint16_t GDC_CLOCKDIVIDERL;
            struct {
              __IO uint8_t GDC_CLOCKDIVIDERLL;
              __IO uint8_t GDC_CLOCKDIVIDERLH;
            };
          };
          union {
            __IO uint16_t GDC_CLOCKDIVIDERH;
            struct {
              __IO uint8_t GDC_CLOCKDIVIDERHL;
              __IO uint8_t GDC_CLOCKDIVIDERHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WKUPTRIGGERMASK;
        stc_gdcsub_wkuptriggermask_field_t WKUPTRIGGERMASK_f;
        struct {
          union {
            __IO uint16_t WKUPTRIGGERMASKL;
            struct {
              __IO uint8_t WKUPTRIGGERMASKLL;
              __IO uint8_t WKUPTRIGGERMASKLH;
            };
          };
          union {
            __IO uint16_t WKUPTRIGGERMASKH;
            struct {
              __IO uint8_t WKUPTRIGGERMASKHL;
              __IO uint8_t WKUPTRIGGERMASKHH;
            };
          };
        };
    };
    union {
        __IO uint32_t CLOCKDOMAINSTATUS;
        stc_gdcsub_clockdomainstatus_field_t CLOCKDOMAINSTATUS_f;
        struct {
          union {
            __IO uint16_t CLOCKDOMAINSTATUSL;
            struct {
              __IO uint8_t CLOCKDOMAINSTATUSLL;
              __IO uint8_t CLOCKDOMAINSTATUSLH;
            };
          };
          union {
            __IO uint16_t CLOCKDOMAINSTATUSH;
            struct {
              __IO uint8_t CLOCKDOMAINSTATUSHL;
              __IO uint8_t CLOCKDOMAINSTATUSHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED2[8];
    union {
        __IO uint32_t DSP_LOCKUNLOCK;
        stc_gdcsub_dsp_lockunlock_field_t DSP_LOCKUNLOCK_f;
        struct {
          union {
            __IO uint16_t DSP_LOCKUNLOCKL;
            struct {
              __IO uint8_t DSP_LOCKUNLOCKLL;
              __IO uint8_t DSP_LOCKUNLOCKLH;
            };
          };
          union {
            __IO uint16_t DSP_LOCKUNLOCKH;
            struct {
              __IO uint8_t DSP_LOCKUNLOCKHL;
              __IO uint8_t DSP_LOCKUNLOCKHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DSP_LOCKSTATUS;
        stc_gdcsub_dsp_lockstatus_field_t DSP_LOCKSTATUS_f;
        struct {
          union {
            __IO uint16_t DSP_LOCKSTATUSL;
            struct {
              __IO uint8_t DSP_LOCKSTATUSLL;
              __IO uint8_t DSP_LOCKSTATUSLH;
            };
          };
          union {
            __IO uint16_t DSP_LOCKSTATUSH;
            struct {
              __IO uint8_t DSP_LOCKSTATUSHL;
              __IO uint8_t DSP_LOCKSTATUSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DSP0_CLOCKDIVIDER;
        stc_gdcsub_dsp0_clockdivider_field_t DSP0_CLOCKDIVIDER_f;
        struct {
          union {
            __IO uint16_t DSP0_CLOCKDIVIDERL;
            struct {
              __IO uint8_t DSP0_CLOCKDIVIDERLL;
              __IO uint8_t DSP0_CLOCKDIVIDERLH;
            };
          };
          union {
            __IO uint16_t DSP0_CLOCKDIVIDERH;
            struct {
              __IO uint8_t DSP0_CLOCKDIVIDERHL;
              __IO uint8_t DSP0_CLOCKDIVIDERHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DSP0_DOMAINCONTROL;
        stc_gdcsub_dsp0_domaincontrol_field_t DSP0_DOMAINCONTROL_f;
        struct {
          union {
            __IO uint16_t DSP0_DOMAINCONTROLL;
            struct {
              __IO uint8_t DSP0_DOMAINCONTROLLL;
              __IO uint8_t DSP0_DOMAINCONTROLLH;
            };
          };
          union {
            __IO uint16_t DSP0_DOMAINCONTROLH;
            struct {
              __IO uint8_t DSP0_DOMAINCONTROLHL;
              __IO uint8_t DSP0_DOMAINCONTROLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DSP0_CLOCKSHIFT;
        stc_gdcsub_dsp0_clockshift_field_t DSP0_CLOCKSHIFT_f;
        struct {
          union {
            __IO uint16_t DSP0_CLOCKSHIFTL;
            struct {
              __IO uint8_t DSP0_CLOCKSHIFTLL;
              __IO uint8_t DSP0_CLOCKSHIFTLH;
            };
          };
          union {
            __IO uint16_t DSP0_CLOCKSHIFTH;
            struct {
              __IO uint8_t DSP0_CLOCKSHIFTHL;
              __IO uint8_t DSP0_CLOCKSHIFTHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED3[4];
    union {
        __IO uint32_t DSP0_POWERENCONTROL;
        stc_gdcsub_dsp0_powerencontrol_field_t DSP0_POWERENCONTROL_f;
        struct {
          union {
            __IO uint16_t DSP0_POWERENCONTROLL;
            struct {
              __IO uint8_t DSP0_POWERENCONTROLLL;
              __IO uint8_t DSP0_POWERENCONTROLLH;
            };
          };
          union {
            __IO uint16_t DSP0_POWERENCONTROLH;
            struct {
              __IO uint8_t DSP0_POWERENCONTROLHL;
              __IO uint8_t DSP0_POWERENCONTROLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DSP0_CLOCKGATEMODELOCK;
        stc_gdcsub_dsp0_clockgatemodelock_field_t DSP0_CLOCKGATEMODELOCK_f;
        struct {
          union {
            __IO uint16_t DSP0_CLOCKGATEMODELOCKL;
            struct {
              __IO uint8_t DSP0_CLOCKGATEMODELOCKLL;
              __IO uint8_t DSP0_CLOCKGATEMODELOCKLH;
            };
          };
          union {
            __IO uint16_t DSP0_CLOCKGATEMODELOCKH;
            struct {
              __IO uint8_t DSP0_CLOCKGATEMODELOCKHL;
              __IO uint8_t DSP0_CLOCKGATEMODELOCKHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DSP0_CLOCKGATECONTROL;
        stc_gdcsub_dsp0_clockgatecontrol_field_t DSP0_CLOCKGATECONTROL_f;
        struct {
          union {
            __IO uint16_t DSP0_CLOCKGATECONTROLL;
            struct {
              __IO uint8_t DSP0_CLOCKGATECONTROLLL;
              __IO uint8_t DSP0_CLOCKGATECONTROLLH;
            };
          };
          union {
            __IO uint16_t DSP0_CLOCKGATECONTROLH;
            struct {
              __IO uint8_t DSP0_CLOCKGATECONTROLHL;
              __IO uint8_t DSP0_CLOCKGATECONTROLHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED4[20];
    union {
        __IO uint32_t SDRAMC_CLOCKDIVIDER;
        stc_gdcsub_sdramc_clockdivider_field_t SDRAMC_CLOCKDIVIDER_f;
        struct {
          union {
            __IO uint16_t SDRAMC_CLOCKDIVIDERL;
            struct {
              __IO uint8_t SDRAMC_CLOCKDIVIDERLL;
              __IO uint8_t SDRAMC_CLOCKDIVIDERLH;
            };
          };
          union {
            __IO uint16_t SDRAMC_CLOCKDIVIDERH;
            struct {
              __IO uint8_t SDRAMC_CLOCKDIVIDERHL;
              __IO uint8_t SDRAMC_CLOCKDIVIDERHH;
            };
          };
        };
    };
    union {
        __IO uint32_t SDRAMC_DOMAINCONTROL;
        stc_gdcsub_sdramc_domaincontrol_field_t SDRAMC_DOMAINCONTROL_f;
        struct {
          union {
            __IO uint16_t SDRAMC_DOMAINCONTROLL;
            struct {
              __IO uint8_t SDRAMC_DOMAINCONTROLLL;
              __IO uint8_t SDRAMC_DOMAINCONTROLLH;
            };
          };
          union {
            __IO uint16_t SDRAMC_DOMAINCONTROLH;
            struct {
              __IO uint8_t SDRAMC_DOMAINCONTROLHL;
              __IO uint8_t SDRAMC_DOMAINCONTROLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t HSSPIC_CLOCKDIVIDER;
        stc_gdcsub_hsspic_clockdivider_field_t HSSPIC_CLOCKDIVIDER_f;
        struct {
          union {
            __IO uint16_t HSSPIC_CLOCKDIVIDERL;
            struct {
              __IO uint8_t HSSPIC_CLOCKDIVIDERLL;
              __IO uint8_t HSSPIC_CLOCKDIVIDERLH;
            };
          };
          union {
            __IO uint16_t HSSPIC_CLOCKDIVIDERH;
            struct {
              __IO uint8_t HSSPIC_CLOCKDIVIDERHL;
              __IO uint8_t HSSPIC_CLOCKDIVIDERHH;
            };
          };
        };
    };
    union {
        __IO uint32_t HSSPIC_DOMAINCONTROL;
        stc_gdcsub_hsspic_domaincontrol_field_t HSSPIC_DOMAINCONTROL_f;
        struct {
          union {
            __IO uint16_t HSSPIC_DOMAINCONTROLL;
            struct {
              __IO uint8_t HSSPIC_DOMAINCONTROLLL;
              __IO uint8_t HSSPIC_DOMAINCONTROLLH;
            };
          };
          union {
            __IO uint16_t HSSPIC_DOMAINCONTROLH;
            struct {
              __IO uint8_t HSSPIC_DOMAINCONTROLHL;
              __IO uint8_t HSSPIC_DOMAINCONTROLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RPCC_CLOCKDIVIDER;
        stc_gdcsub_rpcc_clockdivider_field_t RPCC_CLOCKDIVIDER_f;
        struct {
          union {
            __IO uint16_t RPCC_CLOCKDIVIDERL;
            struct {
              __IO uint8_t RPCC_CLOCKDIVIDERLL;
              __IO uint8_t RPCC_CLOCKDIVIDERLH;
            };
          };
          union {
            __IO uint16_t RPCC_CLOCKDIVIDERH;
            struct {
              __IO uint8_t RPCC_CLOCKDIVIDERHL;
              __IO uint8_t RPCC_CLOCKDIVIDERHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RPCC_DOMAINCONTROL;
        stc_gdcsub_rpcc_domaincontrol_field_t RPCC_DOMAINCONTROL_f;
        struct {
          union {
            __IO uint16_t RPCC_DOMAINCONTROLL;
            struct {
              __IO uint8_t RPCC_DOMAINCONTROLLL;
              __IO uint8_t RPCC_DOMAINCONTROLLH;
            };
          };
          union {
            __IO uint16_t RPCC_DOMAINCONTROLH;
            struct {
              __IO uint8_t RPCC_DOMAINCONTROLHL;
              __IO uint8_t RPCC_DOMAINCONTROLHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED5[112];
    union {
        __IO uint32_t VRAM_LOCKUNLOCK;
        stc_gdcsub_vram_lockunlock_field_t VRAM_LOCKUNLOCK_f;
        struct {
          union {
            __IO uint16_t VRAM_LOCKUNLOCKL;
            struct {
              __IO uint8_t VRAM_LOCKUNLOCKLL;
              __IO uint8_t VRAM_LOCKUNLOCKLH;
            };
          };
          union {
            __IO uint16_t VRAM_LOCKUNLOCKH;
            struct {
              __IO uint8_t VRAM_LOCKUNLOCKHL;
              __IO uint8_t VRAM_LOCKUNLOCKHH;
            };
          };
        };
    };
    union {
        __IO uint32_t VRAM_LOCKSTATUS;
        stc_gdcsub_vram_lockstatus_field_t VRAM_LOCKSTATUS_f;
        struct {
          union {
            __IO uint16_t VRAM_LOCKSTATUSL;
            struct {
              __IO uint8_t VRAM_LOCKSTATUSLL;
              __IO uint8_t VRAM_LOCKSTATUSLH;
            };
          };
          union {
            __IO uint16_t VRAM_LOCKSTATUSH;
            struct {
              __IO uint8_t VRAM_LOCKSTATUSHL;
              __IO uint8_t VRAM_LOCKSTATUSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t VRAM_SRAM_SELECT;
        stc_gdcsub_vram_sram_select_field_t VRAM_SRAM_SELECT_f;
        struct {
          union {
            __IO uint16_t VRAM_SRAM_SELECTL;
            struct {
              __IO uint8_t VRAM_SRAM_SELECTLL;
              __IO uint8_t VRAM_SRAM_SELECTLH;
            };
          };
          union {
            __IO uint16_t VRAM_SRAM_SELECTH;
            struct {
              __IO uint8_t VRAM_SRAM_SELECTHL;
              __IO uint8_t VRAM_SRAM_SELECTHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED6[48];
    union {
        __IO uint32_t VRAM_SBERRADDR_S0;
        stc_gdcsub_vram_sberraddr_s0_field_t VRAM_SBERRADDR_S0_f;
        struct {
          union {
            __IO uint16_t VRAM_SBERRADDR_S0L;
            struct {
              __IO uint8_t VRAM_SBERRADDR_S0LL;
              __IO uint8_t VRAM_SBERRADDR_S0LH;
            };
          };
          union {
            __IO uint16_t VRAM_SBERRADDR_S0H;
            struct {
              __IO uint8_t VRAM_SBERRADDR_S0HL;
              __IO uint8_t VRAM_SBERRADDR_S0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t VRAM_SBERRADDR_S1;
        stc_gdcsub_vram_sberraddr_s1_field_t VRAM_SBERRADDR_S1_f;
        struct {
          union {
            __IO uint16_t VRAM_SBERRADDR_S1L;
            struct {
              __IO uint8_t VRAM_SBERRADDR_S1LL;
              __IO uint8_t VRAM_SBERRADDR_S1LH;
            };
          };
          union {
            __IO uint16_t VRAM_SBERRADDR_S1H;
            struct {
              __IO uint8_t VRAM_SBERRADDR_S1HL;
              __IO uint8_t VRAM_SBERRADDR_S1HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED7[4];
    union {
        __IO uint32_t VRAM_ARBITER_PRIORITY;
        stc_gdcsub_vram_arbiter_priority_field_t VRAM_ARBITER_PRIORITY_f;
        struct {
          union {
            __IO uint16_t VRAM_ARBITER_PRIORITYL;
            struct {
              __IO uint8_t VRAM_ARBITER_PRIORITYLL;
              __IO uint8_t VRAM_ARBITER_PRIORITYLH;
            };
          };
          union {
            __IO uint16_t VRAM_ARBITER_PRIORITYH;
            struct {
              __IO uint8_t VRAM_ARBITER_PRIORITYHL;
              __IO uint8_t VRAM_ARBITER_PRIORITYHH;
            };
          };
        };
    };
} FM_GDCSUB_TypeDef, FM4_GDCSUB_TypeDef;

