mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/common/s6e2d5xj.h
/*******************************************************************************
* HWWDT_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t WDG_LDR;
        struct {
          union {
            __IO uint16_t WDG_LDRL;
            struct {
              __IO uint8_t WDG_LDRLL;
              __IO uint8_t WDG_LDRLH;
            };
          };
          union {
            __IO uint16_t WDG_LDRH;
            struct {
              __IO uint8_t WDG_LDRHL;
              __IO uint8_t WDG_LDRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_VLR;
        struct {
          union {
            __IO uint16_t WDG_VLRL;
            struct {
              __IO uint8_t WDG_VLRLL;
              __IO uint8_t WDG_VLRLH;
            };
          };
          union {
            __IO uint16_t WDG_VLRH;
            struct {
              __IO uint8_t WDG_VLRHL;
              __IO uint8_t WDG_VLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_CTL;
        stc_hwwdt_wdg_ctl_field_t WDG_CTL_f;
        struct {
          union {
            __IO uint16_t WDG_CTLL;
            struct {
              __IO uint8_t WDG_CTLLL;
              __IO uint8_t WDG_CTLLH;
            };
          };
          union {
            __IO uint16_t WDG_CTLH;
            struct {
              __IO uint8_t WDG_CTLHL;
              __IO uint8_t WDG_CTLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_ICL;
        struct {
          union {
            __IO uint16_t WDG_ICLL;
            struct {
              __IO uint8_t WDG_ICLLL;
              __IO uint8_t WDG_ICLLH;
            };
          };
          union {
            __IO uint16_t WDG_ICLH;
            struct {
              __IO uint8_t WDG_ICLHL;
              __IO uint8_t WDG_ICLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_RIS;
        stc_hwwdt_wdg_ris_field_t WDG_RIS_f;
        struct {
          union {
            __IO uint16_t WDG_RISL;
            struct {
              __IO uint8_t WDG_RISLL;
              __IO uint8_t WDG_RISLH;
            };
          };
          union {
            __IO uint16_t WDG_RISH;
            struct {
              __IO uint8_t WDG_RISHL;
              __IO uint8_t WDG_RISHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[3052];
    union {
        __IO uint32_t WDG_LCK;
        struct {
          union {
            __IO uint16_t WDG_LCKL;
            struct {
              __IO uint8_t WDG_LCKLL;
              __IO uint8_t WDG_LCKLH;
            };
          };
          union {
            __IO uint16_t WDG_LCKH;
            struct {
              __IO uint8_t WDG_LCKHL;
              __IO uint8_t WDG_LCKHH;
            };
          };
        };
    };
} FM_HWWDT_TypeDef, FM4_HWWDT_TypeDef;

/*******************************************************************************
* HYPERBUS_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t CSR;
        stc_hyperbus_csr_field_t CSR_f;
        struct {
          union {
            __IO uint16_t CSRL;
            struct {
              __IO uint8_t CSRLL;
              __IO uint8_t CSRLH;
            };
          };
          union {
            __IO uint16_t CSRH;
            struct {
              __IO uint8_t CSRHL;
              __IO uint8_t CSRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IEN;
        stc_hyperbus_ien_field_t IEN_f;
        struct {
          union {
            __IO uint16_t IENL;
            struct {
              __IO uint8_t IENLL;
              __IO uint8_t IENLH;
            };
          };
          union {
            __IO uint16_t IENH;
            struct {
              __IO uint8_t IENHL;
              __IO uint8_t IENHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ISR;
        stc_hyperbus_isr_field_t ISR_f;
        struct {
          union {
            __IO uint16_t ISRL;
            struct {
              __IO uint8_t ISRLL;
              __IO uint8_t ISRLH;
            };
          };
          union {
            __IO uint16_t ISRH;
            struct {
              __IO uint8_t ISRHL;
              __IO uint8_t ISRHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[4];
    union {
        __IO uint32_t MBR0;
        stc_hyperbus_mbr0_field_t MBR0_f;
        struct {
          union {
            __IO uint16_t MBR0L;
            struct {
              __IO uint8_t MBR0LL;
              __IO uint8_t MBR0LH;
            };
          };
          union {
            __IO uint16_t MBR0H;
            struct {
              __IO uint8_t MBR0HL;
              __IO uint8_t MBR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t MBR1;
        stc_hyperbus_mbr1_field_t MBR1_f;
        struct {
          union {
            __IO uint16_t MBR1L;
            struct {
              __IO uint8_t MBR1LL;
              __IO uint8_t MBR1LH;
            };
          };
          union {
            __IO uint16_t MBR1H;
            struct {
              __IO uint8_t MBR1HL;
              __IO uint8_t MBR1HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[8];
    union {
        __IO uint32_t MCR0;
        stc_hyperbus_mcr0_field_t MCR0_f;
        struct {
          union {
            __IO uint16_t MCR0L;
            struct {
              __IO uint8_t MCR0LL;
              __IO uint8_t MCR0LH;
            };
          };
          union {
            __IO uint16_t MCR0H;
            struct {
              __IO uint8_t MCR0HL;
              __IO uint8_t MCR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t MCR1;
        stc_hyperbus_mcr1_field_t MCR1_f;
        struct {
          union {
            __IO uint16_t MCR1L;
            struct {
              __IO uint8_t MCR1LL;
              __IO uint8_t MCR1LH;
            };
          };
          union {
            __IO uint16_t MCR1H;
            struct {
              __IO uint8_t MCR1HL;
              __IO uint8_t MCR1HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED2[8];
    union {
        __IO uint32_t MTR0;
        stc_hyperbus_mtr0_field_t MTR0_f;
        struct {
          union {
            __IO uint16_t MTR0L;
            struct {
              __IO uint8_t MTR0LL;
              __IO uint8_t MTR0LH;
            };
          };
          union {
            __IO uint16_t MTR0H;
            struct {
              __IO uint8_t MTR0HL;
              __IO uint8_t MTR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t MTR1;
        stc_hyperbus_mtr1_field_t MTR1_f;
        struct {
          union {
            __IO uint16_t MTR1L;
            struct {
              __IO uint8_t MTR1LL;
              __IO uint8_t MTR1LH;
            };
          };
          union {
            __IO uint16_t MTR1H;
            struct {
              __IO uint8_t MTR1HL;
              __IO uint8_t MTR1HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED3[8];
    union {
        __IO uint32_t GPOR;
        stc_hyperbus_gpor_field_t GPOR_f;
        struct {
          union {
            __IO uint16_t GPORL;
            struct {
              __IO uint8_t GPORLL;
              __IO uint8_t GPORLH;
            };
          };
          union {
            __IO uint16_t GPORH;
            struct {
              __IO uint8_t GPORHL;
              __IO uint8_t GPORHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WPR;
        stc_hyperbus_wpr_field_t WPR_f;
        struct {
          union {
            __IO uint16_t WPRL;
            struct {
              __IO uint8_t WPRLL;
              __IO uint8_t WPRLH;
            };
          };
          union {
            __IO uint16_t WPRH;
            struct {
              __IO uint8_t WPRHL;
              __IO uint8_t WPRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TEST;
        stc_hyperbus_test_field_t TEST_f;
        struct {
          union {
            __IO uint16_t TESTL;
            struct {
              __IO uint8_t TESTLL;
              __IO uint8_t TESTLH;
            };
          };
          union {
            __IO uint16_t TESTH;
            struct {
              __IO uint8_t TESTHL;
              __IO uint8_t TESTHH;
            };
          };
        };
    };
} FM_HYPERBUS_TypeDef, FM4_HYPERBUS_TypeDef;

