mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/common/s6e2d5xj.h
#define FM_GPIO_EPFR19                            *((volatile uint32_t*)(0x4006F64CUL))
#define FM4_GPIO_EPFR19                           *((volatile uint32_t*)(0x4006F64CUL))
#define FM_GPIO_EPFR20                            *((volatile uint32_t*)(0x4006F650UL))
#define FM4_GPIO_EPFR20                           *((volatile uint32_t*)(0x4006F650UL))
#define FM_GPIO_EPFR21                            *((volatile uint32_t*)(0x4006F654UL))
#define FM4_GPIO_EPFR21                           *((volatile uint32_t*)(0x4006F654UL))
#define FM_GPIO_EPFR22                            *((volatile uint32_t*)(0x4006F658UL))
#define FM4_GPIO_EPFR22                           *((volatile uint32_t*)(0x4006F658UL))
#define FM_GPIO_EPFR23                            *((volatile uint32_t*)(0x4006F65CUL))
#define FM4_GPIO_EPFR23                           *((volatile uint32_t*)(0x4006F65CUL))
#define FM_GPIO_EPFR24                            *((volatile uint32_t*)(0x4006F660UL))
#define FM4_GPIO_EPFR24                           *((volatile uint32_t*)(0x4006F660UL))
#define FM_GPIO_EPFR25                            *((volatile uint32_t*)(0x4006F664UL))
#define FM4_GPIO_EPFR25                           *((volatile uint32_t*)(0x4006F664UL))
#define FM_GPIO_EPFR26                            *((volatile uint32_t*)(0x4006F668UL))
#define FM4_GPIO_EPFR26                           *((volatile uint32_t*)(0x4006F668UL))
#define FM_GPIO_EPFR27                            *((volatile uint32_t*)(0x4006F66CUL))
#define FM4_GPIO_EPFR27                           *((volatile uint32_t*)(0x4006F66CUL))
#define FM_GPIO_EPFR28                            *((volatile uint32_t*)(0x4006F670UL))
#define FM4_GPIO_EPFR28                           *((volatile uint32_t*)(0x4006F670UL))
#define FM_GPIO_EPFR29                            *((volatile uint32_t*)(0x4006F674UL))
#define FM4_GPIO_EPFR29                           *((volatile uint32_t*)(0x4006F674UL))
#define FM_GPIO_EPFR30                            *((volatile uint32_t*)(0x4006F678UL))
#define FM4_GPIO_EPFR30                           *((volatile uint32_t*)(0x4006F678UL))
#define FM_GPIO_PZR0                              *((volatile uint32_t*)(0x4006F700UL))
#define FM4_GPIO_PZR0                             *((volatile uint32_t*)(0x4006F700UL))
#define FM_GPIO_PZR1                              *((volatile uint32_t*)(0x4006F704UL))
#define FM4_GPIO_PZR1                             *((volatile uint32_t*)(0x4006F704UL))
#define FM_GPIO_PZR2                              *((volatile uint32_t*)(0x4006F708UL))
#define FM4_GPIO_PZR2                             *((volatile uint32_t*)(0x4006F708UL))
#define FM_GPIO_PZR3                              *((volatile uint32_t*)(0x4006F70CUL))
#define FM4_GPIO_PZR3                             *((volatile uint32_t*)(0x4006F70CUL))
#define FM_GPIO_PZR4                              *((volatile uint32_t*)(0x4006F710UL))
#define FM4_GPIO_PZR4                             *((volatile uint32_t*)(0x4006F710UL))
#define FM_GPIO_PZR5                              *((volatile uint32_t*)(0x4006F714UL))
#define FM4_GPIO_PZR5                             *((volatile uint32_t*)(0x4006F714UL))
#define FM_GPIO_PZR6                              *((volatile uint32_t*)(0x4006F718UL))
#define FM4_GPIO_PZR6                             *((volatile uint32_t*)(0x4006F718UL))
#define FM_GPIO_PZR7                              *((volatile uint32_t*)(0x4006F71CUL))
#define FM4_GPIO_PZR7                             *((volatile uint32_t*)(0x4006F71CUL))
#define FM_GPIO_PZR8                              *((volatile uint32_t*)(0x4006F720UL))
#define FM4_GPIO_PZR8                             *((volatile uint32_t*)(0x4006F720UL))
#define FM_GPIO_PZR9                              *((volatile uint32_t*)(0x4006F724UL))
#define FM4_GPIO_PZR9                             *((volatile uint32_t*)(0x4006F724UL))
#define FM_GPIO_PZRA                              *((volatile uint32_t*)(0x4006F728UL))
#define FM4_GPIO_PZRA                             *((volatile uint32_t*)(0x4006F728UL))
#define FM_GPIO_PZRB                              *((volatile uint32_t*)(0x4006F72CUL))
#define FM4_GPIO_PZRB                             *((volatile uint32_t*)(0x4006F72CUL))
#define FM_GPIO_PZRC                              *((volatile uint32_t*)(0x4006F730UL))
#define FM4_GPIO_PZRC                             *((volatile uint32_t*)(0x4006F730UL))
#define FM_GPIO_PZRD                              *((volatile uint32_t*)(0x4006F734UL))
#define FM4_GPIO_PZRD                             *((volatile uint32_t*)(0x4006F734UL))
#define FM_GPIO_PZRE                              *((volatile uint32_t*)(0x4006F738UL))
#define FM4_GPIO_PZRE                             *((volatile uint32_t*)(0x4006F738UL))
#define FM_GPIO_PZRF                              *((volatile uint32_t*)(0x4006F73CUL))
#define FM4_GPIO_PZRF                             *((volatile uint32_t*)(0x4006F73CUL))

/*******************************************************************************
* HSSPI Registers HSSPI
*   Register Definition
*******************************************************************************/
#define FM_HSSPI_MCTRL                            *((volatile uint32_t*)(0xD0A04000UL))
#define FM4_HSSPI_MCTRL                           *((volatile uint32_t*)(0xD0A04000UL))
#define FM_HSSPI_PCC0                             *((volatile uint32_t*)(0xD0A04004UL))
#define FM4_HSSPI_PCC0                            *((volatile uint32_t*)(0xD0A04004UL))
#define FM_HSSPI_PCC1                             *((volatile uint32_t*)(0xD0A04008UL))
#define FM4_HSSPI_PCC1                            *((volatile uint32_t*)(0xD0A04008UL))
#define FM_HSSPI_PCC2                             *((volatile uint32_t*)(0xD0A0400CUL))
#define FM4_HSSPI_PCC2                            *((volatile uint32_t*)(0xD0A0400CUL))
#define FM_HSSPI_PCC3                             *((volatile uint32_t*)(0xD0A04010UL))
#define FM4_HSSPI_PCC3                            *((volatile uint32_t*)(0xD0A04010UL))
#define FM_HSSPI_TXF                              *((volatile uint32_t*)(0xD0A04014UL))
#define FM4_HSSPI_TXF                             *((volatile uint32_t*)(0xD0A04014UL))
#define FM_HSSPI_TXE                              *((volatile uint32_t*)(0xD0A04018UL))
#define FM4_HSSPI_TXE                             *((volatile uint32_t*)(0xD0A04018UL))
#define FM_HSSPI_TXC                              *((volatile uint32_t*)(0xD0A0401CUL))
#define FM4_HSSPI_TXC                             *((volatile uint32_t*)(0xD0A0401CUL))
#define FM_HSSPI_RXF                              *((volatile uint32_t*)(0xD0A04020UL))
#define FM4_HSSPI_RXF                             *((volatile uint32_t*)(0xD0A04020UL))
#define FM_HSSPI_RXE                              *((volatile uint32_t*)(0xD0A04024UL))
#define FM4_HSSPI_RXE                             *((volatile uint32_t*)(0xD0A04024UL))
#define FM_HSSPI_RXC                              *((volatile uint32_t*)(0xD0A04028UL))
#define FM4_HSSPI_RXC                             *((volatile uint32_t*)(0xD0A04028UL))
#define FM_HSSPI_FAULTF                           *((volatile uint32_t*)(0xD0A0402CUL))
#define FM4_HSSPI_FAULTF                          *((volatile uint32_t*)(0xD0A0402CUL))
#define FM_HSSPI_FAULTC                           *((volatile uint32_t*)(0xD0A04030UL))
#define FM4_HSSPI_FAULTC                          *((volatile uint32_t*)(0xD0A04030UL))
#define FM_HSSPI_DMCFG                            *((volatile  uint8_t*)(0xD0A04034UL))
#define FM4_HSSPI_DMCFG                           *((volatile  uint8_t*)(0xD0A04034UL))
#define FM_HSSPI_DMDMAEN                          *((volatile  uint8_t*)(0xD0A04035UL))
#define FM4_HSSPI_DMDMAEN                         *((volatile  uint8_t*)(0xD0A04035UL))
#define FM_HSSPI_DMSTART                          *((volatile  uint8_t*)(0xD0A04038UL))
#define FM4_HSSPI_DMSTART                         *((volatile  uint8_t*)(0xD0A04038UL))
#define FM_HSSPI_DMSTOP                           *((volatile  uint8_t*)(0xD0A04039UL))
#define FM4_HSSPI_DMSTOP                          *((volatile  uint8_t*)(0xD0A04039UL))
#define FM_HSSPI_DMPSEL                           *((volatile  uint8_t*)(0xD0A0403AUL))
#define FM4_HSSPI_DMPSEL                          *((volatile  uint8_t*)(0xD0A0403AUL))
#define FM_HSSPI_DMTRP                            *((volatile  uint8_t*)(0xD0A0403BUL))
#define FM4_HSSPI_DMTRP                           *((volatile  uint8_t*)(0xD0A0403BUL))
#define FM_HSSPI_DMBCC                            *((volatile uint16_t*)(0xD0A0403CUL))
#define FM4_HSSPI_DMBCC                           *((volatile uint16_t*)(0xD0A0403CUL))
#define FM_HSSPI_DMBCS                            *((volatile uint16_t*)(0xD0A0403EUL))
#define FM4_HSSPI_DMBCS                           *((volatile uint16_t*)(0xD0A0403EUL))
#define FM_HSSPI_DMSTATUS                         *((volatile uint32_t*)(0xD0A04040UL))
#define FM4_HSSPI_DMSTATUS                        *((volatile uint32_t*)(0xD0A04040UL))
#define FM_HSSPI_FIFOCFG                          *((volatile uint32_t*)(0xD0A0404CUL))
#define FM4_HSSPI_FIFOCFG                         *((volatile uint32_t*)(0xD0A0404CUL))
#define FM_HSSPI_TXFIFO0                          *((volatile uint32_t*)(0xD0A04050UL))
#define FM4_HSSPI_TXFIFO0                         *((volatile uint32_t*)(0xD0A04050UL))
#define FM_HSSPI_TXFIFO1                          *((volatile uint32_t*)(0xD0A04054UL))
#define FM4_HSSPI_TXFIFO1                         *((volatile uint32_t*)(0xD0A04054UL))
#define FM_HSSPI_TXFIFO2                          *((volatile uint32_t*)(0xD0A04058UL))
#define FM4_HSSPI_TXFIFO2                         *((volatile uint32_t*)(0xD0A04058UL))
#define FM_HSSPI_TXFIFO3                          *((volatile uint32_t*)(0xD0A0405CUL))
#define FM4_HSSPI_TXFIFO3                         *((volatile uint32_t*)(0xD0A0405CUL))
#define FM_HSSPI_TXFIFO4                          *((volatile uint32_t*)(0xD0A04060UL))
#define FM4_HSSPI_TXFIFO4                         *((volatile uint32_t*)(0xD0A04060UL))
#define FM_HSSPI_TXFIFO5                          *((volatile uint32_t*)(0xD0A04064UL))
#define FM4_HSSPI_TXFIFO5                         *((volatile uint32_t*)(0xD0A04064UL))
#define FM_HSSPI_TXFIFO6                          *((volatile uint32_t*)(0xD0A04068UL))
#define FM4_HSSPI_TXFIFO6                         *((volatile uint32_t*)(0xD0A04068UL))
#define FM_HSSPI_TXFIFO7                          *((volatile uint32_t*)(0xD0A0406CUL))
#define FM4_HSSPI_TXFIFO7                         *((volatile uint32_t*)(0xD0A0406CUL))
#define FM_HSSPI_TXFIFO8                          *((volatile uint32_t*)(0xD0A04070UL))
#define FM4_HSSPI_TXFIFO8                         *((volatile uint32_t*)(0xD0A04070UL))
#define FM_HSSPI_TXFIFO9                          *((volatile uint32_t*)(0xD0A04074UL))
#define FM4_HSSPI_TXFIFO9                         *((volatile uint32_t*)(0xD0A04074UL))
#define FM_HSSPI_TXFIFO10                         *((volatile uint32_t*)(0xD0A04078UL))
#define FM4_HSSPI_TXFIFO10                        *((volatile uint32_t*)(0xD0A04078UL))
#define FM_HSSPI_TXFIFO11                         *((volatile uint32_t*)(0xD0A0407CUL))
#define FM4_HSSPI_TXFIFO11                        *((volatile uint32_t*)(0xD0A0407CUL))
#define FM_HSSPI_TXFIFO12                         *((volatile uint32_t*)(0xD0A04080UL))
#define FM4_HSSPI_TXFIFO12                        *((volatile uint32_t*)(0xD0A04080UL))
#define FM_HSSPI_TXFIFO13                         *((volatile uint32_t*)(0xD0A04084UL))
#define FM4_HSSPI_TXFIFO13                        *((volatile uint32_t*)(0xD0A04084UL))
#define FM_HSSPI_TXFIFO14                         *((volatile uint32_t*)(0xD0A04088UL))
#define FM4_HSSPI_TXFIFO14                        *((volatile uint32_t*)(0xD0A04088UL))
#define FM_HSSPI_TXFIFO15                         *((volatile uint32_t*)(0xD0A0408CUL))
#define FM4_HSSPI_TXFIFO15                        *((volatile uint32_t*)(0xD0A0408CUL))
#define FM_HSSPI_RXFIFO0                          *((volatile uint32_t*)(0xD0A04090UL))
#define FM4_HSSPI_RXFIFO0                         *((volatile uint32_t*)(0xD0A04090UL))
#define FM_HSSPI_RXFIFO1                          *((volatile uint32_t*)(0xD0A04094UL))
#define FM4_HSSPI_RXFIFO1                         *((volatile uint32_t*)(0xD0A04094UL))
#define FM_HSSPI_RXFIFO2                          *((volatile uint32_t*)(0xD0A04098UL))
#define FM4_HSSPI_RXFIFO2                         *((volatile uint32_t*)(0xD0A04098UL))
#define FM_HSSPI_RXFIFO3                          *((volatile uint32_t*)(0xD0A0409CUL))
#define FM4_HSSPI_RXFIFO3                         *((volatile uint32_t*)(0xD0A0409CUL))
#define FM_HSSPI_RXFIFO4                          *((volatile uint32_t*)(0xD0A040A0UL))
#define FM4_HSSPI_RXFIFO4                         *((volatile uint32_t*)(0xD0A040A0UL))
#define FM_HSSPI_RXFIFO5                          *((volatile uint32_t*)(0xD0A040A4UL))
#define FM4_HSSPI_RXFIFO5                         *((volatile uint32_t*)(0xD0A040A4UL))
#define FM_HSSPI_RXFIFO6                          *((volatile uint32_t*)(0xD0A040A8UL))
#define FM4_HSSPI_RXFIFO6                         *((volatile uint32_t*)(0xD0A040A8UL))
#define FM_HSSPI_RXFIFO7                          *((volatile uint32_t*)(0xD0A040ACUL))
#define FM4_HSSPI_RXFIFO7                         *((volatile uint32_t*)(0xD0A040ACUL))
#define FM_HSSPI_RXFIFO8                          *((volatile uint32_t*)(0xD0A040B0UL))
#define FM4_HSSPI_RXFIFO8                         *((volatile uint32_t*)(0xD0A040B0UL))
#define FM_HSSPI_RXFIFO9                          *((volatile uint32_t*)(0xD0A040B4UL))
#define FM4_HSSPI_RXFIFO9                         *((volatile uint32_t*)(0xD0A040B4UL))
#define FM_HSSPI_RXFIFO10                         *((volatile uint32_t*)(0xD0A040B8UL))
#define FM4_HSSPI_RXFIFO10                        *((volatile uint32_t*)(0xD0A040B8UL))
#define FM_HSSPI_RXFIFO11                         *((volatile uint32_t*)(0xD0A040BCUL))
#define FM4_HSSPI_RXFIFO11                        *((volatile uint32_t*)(0xD0A040BCUL))
#define FM_HSSPI_RXFIFO12                         *((volatile uint32_t*)(0xD0A040C0UL))
#define FM4_HSSPI_RXFIFO12                        *((volatile uint32_t*)(0xD0A040C0UL))
#define FM_HSSPI_RXFIFO13                         *((volatile uint32_t*)(0xD0A040C4UL))
#define FM4_HSSPI_RXFIFO13                        *((volatile uint32_t*)(0xD0A040C4UL))
#define FM_HSSPI_RXFIFO14                         *((volatile uint32_t*)(0xD0A040C8UL))
#define FM4_HSSPI_RXFIFO14                        *((volatile uint32_t*)(0xD0A040C8UL))
#define FM_HSSPI_RXFIFO15                         *((volatile uint32_t*)(0xD0A040CCUL))
#define FM4_HSSPI_RXFIFO15                        *((volatile uint32_t*)(0xD0A040CCUL))
#define FM_HSSPI_CSCFG                            *((volatile uint32_t*)(0xD0A040D0UL))
#define FM4_HSSPI_CSCFG                           *((volatile uint32_t*)(0xD0A040D0UL))
#define FM_HSSPI_CSITIME                          *((volatile uint32_t*)(0xD0A040D4UL))
#define FM4_HSSPI_CSITIME                         *((volatile uint32_t*)(0xD0A040D4UL))
#define FM_HSSPI_CSAEXT                           *((volatile uint32_t*)(0xD0A040D8UL))
#define FM4_HSSPI_CSAEXT                          *((volatile uint32_t*)(0xD0A040D8UL))
#define FM_HSSPI_RDCSDC0                          *((volatile uint16_t*)(0xD0A040DCUL))
#define FM4_HSSPI_RDCSDC0                         *((volatile uint16_t*)(0xD0A040DCUL))
#define FM_HSSPI_RDCSDC1                          *((volatile uint16_t*)(0xD0A040DEUL))
#define FM4_HSSPI_RDCSDC1                         *((volatile uint16_t*)(0xD0A040DEUL))
#define FM_HSSPI_RDCSDC2                          *((volatile uint16_t*)(0xD0A040E0UL))
#define FM4_HSSPI_RDCSDC2                         *((volatile uint16_t*)(0xD0A040E0UL))
#define FM_HSSPI_RDCSDC3                          *((volatile uint16_t*)(0xD0A040E2UL))
#define FM4_HSSPI_RDCSDC3                         *((volatile uint16_t*)(0xD0A040E2UL))
#define FM_HSSPI_RDCSDC4                          *((volatile uint16_t*)(0xD0A040E4UL))
#define FM4_HSSPI_RDCSDC4                         *((volatile uint16_t*)(0xD0A040E4UL))
#define FM_HSSPI_RDCSDC5                          *((volatile uint16_t*)(0xD0A040E6UL))
#define FM4_HSSPI_RDCSDC5                         *((volatile uint16_t*)(0xD0A040E6UL))
#define FM_HSSPI_RDCSDC6                          *((volatile uint16_t*)(0xD0A040E8UL))
#define FM4_HSSPI_RDCSDC6                         *((volatile uint16_t*)(0xD0A040E8UL))
#define FM_HSSPI_RDCSDC7                          *((volatile uint16_t*)(0xD0A040EAUL))
#define FM4_HSSPI_RDCSDC7                         *((volatile uint16_t*)(0xD0A040EAUL))
#define FM_HSSPI_WRCSDC0                          *((volatile uint16_t*)(0xD0A040ECUL))
#define FM4_HSSPI_WRCSDC0                         *((volatile uint16_t*)(0xD0A040ECUL))
#define FM_HSSPI_WRCSDC1                          *((volatile uint16_t*)(0xD0A040EEUL))
#define FM4_HSSPI_WRCSDC1                         *((volatile uint16_t*)(0xD0A040EEUL))
#define FM_HSSPI_WRCSDC2                          *((volatile uint16_t*)(0xD0A040F0UL))
#define FM4_HSSPI_WRCSDC2                         *((volatile uint16_t*)(0xD0A040F0UL))
#define FM_HSSPI_WRCSDC3                          *((volatile uint16_t*)(0xD0A040F2UL))
#define FM4_HSSPI_WRCSDC3                         *((volatile uint16_t*)(0xD0A040F2UL))
#define FM_HSSPI_WRCSDC4                          *((volatile uint16_t*)(0xD0A040F4UL))
#define FM4_HSSPI_WRCSDC4                         *((volatile uint16_t*)(0xD0A040F4UL))
#define FM_HSSPI_WRCSDC5                          *((volatile uint16_t*)(0xD0A040F6UL))
#define FM4_HSSPI_WRCSDC5                         *((volatile uint16_t*)(0xD0A040F6UL))
#define FM_HSSPI_WRCSDC6                          *((volatile uint16_t*)(0xD0A040F8UL))
#define FM4_HSSPI_WRCSDC6                         *((volatile uint16_t*)(0xD0A040F8UL))
#define FM_HSSPI_WRCSDC7                          *((volatile uint16_t*)(0xD0A040FAUL))
#define FM4_HSSPI_WRCSDC7                         *((volatile uint16_t*)(0xD0A040FAUL))
#define FM_HSSPI_MID                              *((volatile uint32_t*)(0xD0A040FCUL))
#define FM4_HSSPI_MID                             *((volatile uint32_t*)(0xD0A040FCUL))
#define FM_HSSPI_QDCLKR                           *((volatile  uint8_t*)(0xD0A04400UL))
#define FM4_HSSPI_QDCLKR                          *((volatile  uint8_t*)(0xD0A04400UL))
#define FM_HSSPI_DBCNT                            *((volatile  uint8_t*)(0xD0A04404UL))
#define FM4_HSSPI_DBCNT                           *((volatile  uint8_t*)(0xD0A04404UL))

