mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/common/s6e2d5xj.h
#define bFM_GPIO_PDORA_P0                         *((volatile  uint8_t *)(0x42DE8500UL))
#define bFM4_GPIO_PDORA_P0                        *((volatile  uint8_t *)(0x42DE8500UL))
#define bFM_GPIO_PDORA_P1                         *((volatile  uint8_t *)(0x42DE8504UL))
#define bFM4_GPIO_PDORA_P1                        *((volatile  uint8_t *)(0x42DE8504UL))
#define bFM_GPIO_PDORA_P2                         *((volatile  uint8_t *)(0x42DE8508UL))
#define bFM4_GPIO_PDORA_P2                        *((volatile  uint8_t *)(0x42DE8508UL))
#define bFM_GPIO_PDORA_P3                         *((volatile  uint8_t *)(0x42DE850CUL))
#define bFM4_GPIO_PDORA_P3                        *((volatile  uint8_t *)(0x42DE850CUL))
#define bFM_GPIO_PDORA_P4                         *((volatile  uint8_t *)(0x42DE8510UL))
#define bFM4_GPIO_PDORA_P4                        *((volatile  uint8_t *)(0x42DE8510UL))
#define bFM_GPIO_PDORA_P5                         *((volatile  uint8_t *)(0x42DE8514UL))
#define bFM4_GPIO_PDORA_P5                        *((volatile  uint8_t *)(0x42DE8514UL))
#define bFM_GPIO_PDORA_P6                         *((volatile  uint8_t *)(0x42DE8518UL))
#define bFM4_GPIO_PDORA_P6                        *((volatile  uint8_t *)(0x42DE8518UL))
#define bFM_GPIO_PDORA_P7                         *((volatile  uint8_t *)(0x42DE851CUL))
#define bFM4_GPIO_PDORA_P7                        *((volatile  uint8_t *)(0x42DE851CUL))
#define bFM_GPIO_PDORA_P8                         *((volatile  uint8_t *)(0x42DE8520UL))
#define bFM4_GPIO_PDORA_P8                        *((volatile  uint8_t *)(0x42DE8520UL))
#define bFM_GPIO_PDORA_P9                         *((volatile  uint8_t *)(0x42DE8524UL))
#define bFM4_GPIO_PDORA_P9                        *((volatile  uint8_t *)(0x42DE8524UL))
#define bFM_GPIO_PDORA_PA                         *((volatile  uint8_t *)(0x42DE8528UL))
#define bFM4_GPIO_PDORA_PA                        *((volatile  uint8_t *)(0x42DE8528UL))
#define bFM_GPIO_PDORA_PB                         *((volatile  uint8_t *)(0x42DE852CUL))
#define bFM4_GPIO_PDORA_PB                        *((volatile  uint8_t *)(0x42DE852CUL))
#define bFM_GPIO_PDORA_PC                         *((volatile  uint8_t *)(0x42DE8530UL))
#define bFM4_GPIO_PDORA_PC                        *((volatile  uint8_t *)(0x42DE8530UL))
#define bFM_GPIO_PDORA_PD                         *((volatile  uint8_t *)(0x42DE8534UL))
#define bFM4_GPIO_PDORA_PD                        *((volatile  uint8_t *)(0x42DE8534UL))

#define bFM_GPIO_PDORB_P0                         *((volatile  uint8_t *)(0x42DE8580UL))
#define bFM4_GPIO_PDORB_P0                        *((volatile  uint8_t *)(0x42DE8580UL))
#define bFM_GPIO_PDORB_P1                         *((volatile  uint8_t *)(0x42DE8584UL))
#define bFM4_GPIO_PDORB_P1                        *((volatile  uint8_t *)(0x42DE8584UL))
#define bFM_GPIO_PDORB_P2                         *((volatile  uint8_t *)(0x42DE8588UL))
#define bFM4_GPIO_PDORB_P2                        *((volatile  uint8_t *)(0x42DE8588UL))
#define bFM_GPIO_PDORB_P3                         *((volatile  uint8_t *)(0x42DE858CUL))
#define bFM4_GPIO_PDORB_P3                        *((volatile  uint8_t *)(0x42DE858CUL))
#define bFM_GPIO_PDORB_P4                         *((volatile  uint8_t *)(0x42DE8590UL))
#define bFM4_GPIO_PDORB_P4                        *((volatile  uint8_t *)(0x42DE8590UL))
#define bFM_GPIO_PDORB_P5                         *((volatile  uint8_t *)(0x42DE8594UL))
#define bFM4_GPIO_PDORB_P5                        *((volatile  uint8_t *)(0x42DE8594UL))
#define bFM_GPIO_PDORB_P6                         *((volatile  uint8_t *)(0x42DE8598UL))
#define bFM4_GPIO_PDORB_P6                        *((volatile  uint8_t *)(0x42DE8598UL))
#define bFM_GPIO_PDORB_P7                         *((volatile  uint8_t *)(0x42DE859CUL))
#define bFM4_GPIO_PDORB_P7                        *((volatile  uint8_t *)(0x42DE859CUL))
#define bFM_GPIO_PDORB_P8                         *((volatile  uint8_t *)(0x42DE85A0UL))
#define bFM4_GPIO_PDORB_P8                        *((volatile  uint8_t *)(0x42DE85A0UL))
#define bFM_GPIO_PDORB_P9                         *((volatile  uint8_t *)(0x42DE85A4UL))
#define bFM4_GPIO_PDORB_P9                        *((volatile  uint8_t *)(0x42DE85A4UL))
#define bFM_GPIO_PDORB_PA                         *((volatile  uint8_t *)(0x42DE85A8UL))
#define bFM4_GPIO_PDORB_PA                        *((volatile  uint8_t *)(0x42DE85A8UL))
#define bFM_GPIO_PDORB_PB                         *((volatile  uint8_t *)(0x42DE85ACUL))
#define bFM4_GPIO_PDORB_PB                        *((volatile  uint8_t *)(0x42DE85ACUL))
#define bFM_GPIO_PDORB_PC                         *((volatile  uint8_t *)(0x42DE85B0UL))
#define bFM4_GPIO_PDORB_PC                        *((volatile  uint8_t *)(0x42DE85B0UL))
#define bFM_GPIO_PDORB_PD                         *((volatile  uint8_t *)(0x42DE85B4UL))
#define bFM4_GPIO_PDORB_PD                        *((volatile  uint8_t *)(0x42DE85B4UL))

#define bFM_GPIO_PDORC_P0                         *((volatile  uint8_t *)(0x42DE8600UL))
#define bFM4_GPIO_PDORC_P0                        *((volatile  uint8_t *)(0x42DE8600UL))
#define bFM_GPIO_PDORC_P1                         *((volatile  uint8_t *)(0x42DE8604UL))
#define bFM4_GPIO_PDORC_P1                        *((volatile  uint8_t *)(0x42DE8604UL))
#define bFM_GPIO_PDORC_P2                         *((volatile  uint8_t *)(0x42DE8608UL))
#define bFM4_GPIO_PDORC_P2                        *((volatile  uint8_t *)(0x42DE8608UL))
#define bFM_GPIO_PDORC_P3                         *((volatile  uint8_t *)(0x42DE860CUL))
#define bFM4_GPIO_PDORC_P3                        *((volatile  uint8_t *)(0x42DE860CUL))
#define bFM_GPIO_PDORC_P4                         *((volatile  uint8_t *)(0x42DE8610UL))
#define bFM4_GPIO_PDORC_P4                        *((volatile  uint8_t *)(0x42DE8610UL))
#define bFM_GPIO_PDORC_P5                         *((volatile  uint8_t *)(0x42DE8614UL))
#define bFM4_GPIO_PDORC_P5                        *((volatile  uint8_t *)(0x42DE8614UL))
#define bFM_GPIO_PDORC_P6                         *((volatile  uint8_t *)(0x42DE8618UL))
#define bFM4_GPIO_PDORC_P6                        *((volatile  uint8_t *)(0x42DE8618UL))
#define bFM_GPIO_PDORC_P7                         *((volatile  uint8_t *)(0x42DE861CUL))
#define bFM4_GPIO_PDORC_P7                        *((volatile  uint8_t *)(0x42DE861CUL))
#define bFM_GPIO_PDORC_P8                         *((volatile  uint8_t *)(0x42DE8620UL))
#define bFM4_GPIO_PDORC_P8                        *((volatile  uint8_t *)(0x42DE8620UL))
#define bFM_GPIO_PDORC_P9                         *((volatile  uint8_t *)(0x42DE8624UL))
#define bFM4_GPIO_PDORC_P9                        *((volatile  uint8_t *)(0x42DE8624UL))
#define bFM_GPIO_PDORC_PA                         *((volatile  uint8_t *)(0x42DE8628UL))
#define bFM4_GPIO_PDORC_PA                        *((volatile  uint8_t *)(0x42DE8628UL))
#define bFM_GPIO_PDORC_PB                         *((volatile  uint8_t *)(0x42DE862CUL))
#define bFM4_GPIO_PDORC_PB                        *((volatile  uint8_t *)(0x42DE862CUL))
#define bFM_GPIO_PDORC_PC                         *((volatile  uint8_t *)(0x42DE8630UL))
#define bFM4_GPIO_PDORC_PC                        *((volatile  uint8_t *)(0x42DE8630UL))
#define bFM_GPIO_PDORC_PD                         *((volatile  uint8_t *)(0x42DE8634UL))
#define bFM4_GPIO_PDORC_PD                        *((volatile  uint8_t *)(0x42DE8634UL))

#define bFM_GPIO_PDORD_P0                         *((volatile  uint8_t *)(0x42DE8680UL))
#define bFM4_GPIO_PDORD_P0                        *((volatile  uint8_t *)(0x42DE8680UL))
#define bFM_GPIO_PDORD_P1                         *((volatile  uint8_t *)(0x42DE8684UL))
#define bFM4_GPIO_PDORD_P1                        *((volatile  uint8_t *)(0x42DE8684UL))
#define bFM_GPIO_PDORD_P2                         *((volatile  uint8_t *)(0x42DE8688UL))
#define bFM4_GPIO_PDORD_P2                        *((volatile  uint8_t *)(0x42DE8688UL))
#define bFM_GPIO_PDORD_P3                         *((volatile  uint8_t *)(0x42DE868CUL))
#define bFM4_GPIO_PDORD_P3                        *((volatile  uint8_t *)(0x42DE868CUL))
#define bFM_GPIO_PDORD_P4                         *((volatile  uint8_t *)(0x42DE8690UL))
#define bFM4_GPIO_PDORD_P4                        *((volatile  uint8_t *)(0x42DE8690UL))
#define bFM_GPIO_PDORD_P5                         *((volatile  uint8_t *)(0x42DE8694UL))
#define bFM4_GPIO_PDORD_P5                        *((volatile  uint8_t *)(0x42DE8694UL))
#define bFM_GPIO_PDORD_P6                         *((volatile  uint8_t *)(0x42DE8698UL))
#define bFM4_GPIO_PDORD_P6                        *((volatile  uint8_t *)(0x42DE8698UL))
#define bFM_GPIO_PDORD_P7                         *((volatile  uint8_t *)(0x42DE869CUL))
#define bFM4_GPIO_PDORD_P7                        *((volatile  uint8_t *)(0x42DE869CUL))
#define bFM_GPIO_PDORD_P8                         *((volatile  uint8_t *)(0x42DE86A0UL))
#define bFM4_GPIO_PDORD_P8                        *((volatile  uint8_t *)(0x42DE86A0UL))
#define bFM_GPIO_PDORD_P9                         *((volatile  uint8_t *)(0x42DE86A4UL))
#define bFM4_GPIO_PDORD_P9                        *((volatile  uint8_t *)(0x42DE86A4UL))
#define bFM_GPIO_PDORD_PA                         *((volatile  uint8_t *)(0x42DE86A8UL))
#define bFM4_GPIO_PDORD_PA                        *((volatile  uint8_t *)(0x42DE86A8UL))
#define bFM_GPIO_PDORD_PB                         *((volatile  uint8_t *)(0x42DE86ACUL))
#define bFM4_GPIO_PDORD_PB                        *((volatile  uint8_t *)(0x42DE86ACUL))
#define bFM_GPIO_PDORD_PC                         *((volatile  uint8_t *)(0x42DE86B0UL))
#define bFM4_GPIO_PDORD_PC                        *((volatile  uint8_t *)(0x42DE86B0UL))
#define bFM_GPIO_PDORD_PD                         *((volatile  uint8_t *)(0x42DE86B4UL))
#define bFM4_GPIO_PDORD_PD                        *((volatile  uint8_t *)(0x42DE86B4UL))

#define bFM_GPIO_PDORE_P0                         *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P0                        *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P2                        *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x42DE870CUL))
#define bFM4_GPIO_PDORE_P3                        *((volatile  uint8_t *)(0x42DE870CUL))

