mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/common/s6e2d5xj.h
#define bFM_GPIO_PFR6_P0                          *((volatile  uint8_t *)(0x42DE0300UL))
#define bFM4_GPIO_PFR6_P0                         *((volatile  uint8_t *)(0x42DE0300UL))
#define bFM_GPIO_PFR6_P1                          *((volatile  uint8_t *)(0x42DE0304UL))
#define bFM4_GPIO_PFR6_P1                         *((volatile  uint8_t *)(0x42DE0304UL))
#define bFM_GPIO_PFR6_P2                          *((volatile  uint8_t *)(0x42DE0308UL))
#define bFM4_GPIO_PFR6_P2                         *((volatile  uint8_t *)(0x42DE0308UL))
#define bFM_GPIO_PFR6_P3                          *((volatile  uint8_t *)(0x42DE030CUL))
#define bFM4_GPIO_PFR6_P3                         *((volatile  uint8_t *)(0x42DE030CUL))
#define bFM_GPIO_PFR6_P4                          *((volatile  uint8_t *)(0x42DE0310UL))
#define bFM4_GPIO_PFR6_P4                         *((volatile  uint8_t *)(0x42DE0310UL))
#define bFM_GPIO_PFR6_P5                          *((volatile  uint8_t *)(0x42DE0314UL))
#define bFM4_GPIO_PFR6_P5                         *((volatile  uint8_t *)(0x42DE0314UL))
#define bFM_GPIO_PFR6_P6                          *((volatile  uint8_t *)(0x42DE0318UL))
#define bFM4_GPIO_PFR6_P6                         *((volatile  uint8_t *)(0x42DE0318UL))
#define bFM_GPIO_PFR6_P7                          *((volatile  uint8_t *)(0x42DE031CUL))
#define bFM4_GPIO_PFR6_P7                         *((volatile  uint8_t *)(0x42DE031CUL))
#define bFM_GPIO_PFR6_P8                          *((volatile  uint8_t *)(0x42DE0320UL))
#define bFM4_GPIO_PFR6_P8                         *((volatile  uint8_t *)(0x42DE0320UL))

#define bFM_GPIO_PFR7_P0                          *((volatile  uint8_t *)(0x42DE0380UL))
#define bFM4_GPIO_PFR7_P0                         *((volatile  uint8_t *)(0x42DE0380UL))
#define bFM_GPIO_PFR7_P1                          *((volatile  uint8_t *)(0x42DE0384UL))
#define bFM4_GPIO_PFR7_P1                         *((volatile  uint8_t *)(0x42DE0384UL))
#define bFM_GPIO_PFR7_P2                          *((volatile  uint8_t *)(0x42DE0388UL))
#define bFM4_GPIO_PFR7_P2                         *((volatile  uint8_t *)(0x42DE0388UL))
#define bFM_GPIO_PFR7_P3                          *((volatile  uint8_t *)(0x42DE038CUL))
#define bFM4_GPIO_PFR7_P3                         *((volatile  uint8_t *)(0x42DE038CUL))
#define bFM_GPIO_PFR7_P4                          *((volatile  uint8_t *)(0x42DE0390UL))
#define bFM4_GPIO_PFR7_P4                         *((volatile  uint8_t *)(0x42DE0390UL))
#define bFM_GPIO_PFR7_P5                          *((volatile  uint8_t *)(0x42DE0394UL))
#define bFM4_GPIO_PFR7_P5                         *((volatile  uint8_t *)(0x42DE0394UL))
#define bFM_GPIO_PFR7_P6                          *((volatile  uint8_t *)(0x42DE0398UL))
#define bFM4_GPIO_PFR7_P6                         *((volatile  uint8_t *)(0x42DE0398UL))
#define bFM_GPIO_PFR7_P7                          *((volatile  uint8_t *)(0x42DE039CUL))
#define bFM4_GPIO_PFR7_P7                         *((volatile  uint8_t *)(0x42DE039CUL))
#define bFM_GPIO_PFR7_P8                          *((volatile  uint8_t *)(0x42DE03A0UL))
#define bFM4_GPIO_PFR7_P8                         *((volatile  uint8_t *)(0x42DE03A0UL))
#define bFM_GPIO_PFR7_P9                          *((volatile  uint8_t *)(0x42DE03A4UL))
#define bFM4_GPIO_PFR7_P9                         *((volatile  uint8_t *)(0x42DE03A4UL))
#define bFM_GPIO_PFR7_PA                          *((volatile  uint8_t *)(0x42DE03A8UL))
#define bFM4_GPIO_PFR7_PA                         *((volatile  uint8_t *)(0x42DE03A8UL))
#define bFM_GPIO_PFR7_PB                          *((volatile  uint8_t *)(0x42DE03ACUL))
#define bFM4_GPIO_PFR7_PB                         *((volatile  uint8_t *)(0x42DE03ACUL))
#define bFM_GPIO_PFR7_PC                          *((volatile  uint8_t *)(0x42DE03B0UL))
#define bFM4_GPIO_PFR7_PC                         *((volatile  uint8_t *)(0x42DE03B0UL))

#define bFM_GPIO_PFR8_P0                          *((volatile  uint8_t *)(0x42DE0400UL))
#define bFM4_GPIO_PFR8_P0                         *((volatile  uint8_t *)(0x42DE0400UL))
#define bFM_GPIO_PFR8_P1                          *((volatile  uint8_t *)(0x42DE0404UL))
#define bFM4_GPIO_PFR8_P1                         *((volatile  uint8_t *)(0x42DE0404UL))

#define bFM_GPIO_PFR9_P0                          *((volatile  uint8_t *)(0x42DE0480UL))
#define bFM4_GPIO_PFR9_P0                         *((volatile  uint8_t *)(0x42DE0480UL))
#define bFM_GPIO_PFR9_P1                          *((volatile  uint8_t *)(0x42DE0484UL))
#define bFM4_GPIO_PFR9_P1                         *((volatile  uint8_t *)(0x42DE0484UL))
#define bFM_GPIO_PFR9_P2                          *((volatile  uint8_t *)(0x42DE0488UL))
#define bFM4_GPIO_PFR9_P2                         *((volatile  uint8_t *)(0x42DE0488UL))
#define bFM_GPIO_PFR9_P3                          *((volatile  uint8_t *)(0x42DE048CUL))
#define bFM4_GPIO_PFR9_P3                         *((volatile  uint8_t *)(0x42DE048CUL))
#define bFM_GPIO_PFR9_P4                          *((volatile  uint8_t *)(0x42DE0490UL))
#define bFM4_GPIO_PFR9_P4                         *((volatile  uint8_t *)(0x42DE0490UL))
#define bFM_GPIO_PFR9_P5                          *((volatile  uint8_t *)(0x42DE0494UL))
#define bFM4_GPIO_PFR9_P5                         *((volatile  uint8_t *)(0x42DE0494UL))
#define bFM_GPIO_PFR9_P6                          *((volatile  uint8_t *)(0x42DE0498UL))
#define bFM4_GPIO_PFR9_P6                         *((volatile  uint8_t *)(0x42DE0498UL))
#define bFM_GPIO_PFR9_P7                          *((volatile  uint8_t *)(0x42DE049CUL))
#define bFM4_GPIO_PFR9_P7                         *((volatile  uint8_t *)(0x42DE049CUL))

#define bFM_GPIO_PFRA_P0                          *((volatile  uint8_t *)(0x42DE0500UL))
#define bFM4_GPIO_PFRA_P0                         *((volatile  uint8_t *)(0x42DE0500UL))
#define bFM_GPIO_PFRA_P1                          *((volatile  uint8_t *)(0x42DE0504UL))
#define bFM4_GPIO_PFRA_P1                         *((volatile  uint8_t *)(0x42DE0504UL))
#define bFM_GPIO_PFRA_P2                          *((volatile  uint8_t *)(0x42DE0508UL))
#define bFM4_GPIO_PFRA_P2                         *((volatile  uint8_t *)(0x42DE0508UL))
#define bFM_GPIO_PFRA_P3                          *((volatile  uint8_t *)(0x42DE050CUL))
#define bFM4_GPIO_PFRA_P3                         *((volatile  uint8_t *)(0x42DE050CUL))
#define bFM_GPIO_PFRA_P4                          *((volatile  uint8_t *)(0x42DE0510UL))
#define bFM4_GPIO_PFRA_P4                         *((volatile  uint8_t *)(0x42DE0510UL))
#define bFM_GPIO_PFRA_P5                          *((volatile  uint8_t *)(0x42DE0514UL))
#define bFM4_GPIO_PFRA_P5                         *((volatile  uint8_t *)(0x42DE0514UL))
#define bFM_GPIO_PFRA_P6                          *((volatile  uint8_t *)(0x42DE0518UL))
#define bFM4_GPIO_PFRA_P6                         *((volatile  uint8_t *)(0x42DE0518UL))
#define bFM_GPIO_PFRA_P7                          *((volatile  uint8_t *)(0x42DE051CUL))
#define bFM4_GPIO_PFRA_P7                         *((volatile  uint8_t *)(0x42DE051CUL))
#define bFM_GPIO_PFRA_P8                          *((volatile  uint8_t *)(0x42DE0520UL))
#define bFM4_GPIO_PFRA_P8                         *((volatile  uint8_t *)(0x42DE0520UL))
#define bFM_GPIO_PFRA_P9                          *((volatile  uint8_t *)(0x42DE0524UL))
#define bFM4_GPIO_PFRA_P9                         *((volatile  uint8_t *)(0x42DE0524UL))
#define bFM_GPIO_PFRA_PA                          *((volatile  uint8_t *)(0x42DE0528UL))
#define bFM4_GPIO_PFRA_PA                         *((volatile  uint8_t *)(0x42DE0528UL))
#define bFM_GPIO_PFRA_PB                          *((volatile  uint8_t *)(0x42DE052CUL))
#define bFM4_GPIO_PFRA_PB                         *((volatile  uint8_t *)(0x42DE052CUL))
#define bFM_GPIO_PFRA_PC                          *((volatile  uint8_t *)(0x42DE0530UL))
#define bFM4_GPIO_PFRA_PC                         *((volatile  uint8_t *)(0x42DE0530UL))
#define bFM_GPIO_PFRA_PD                          *((volatile  uint8_t *)(0x42DE0534UL))
#define bFM4_GPIO_PFRA_PD                         *((volatile  uint8_t *)(0x42DE0534UL))

#define bFM_GPIO_PFRB_P0                          *((volatile  uint8_t *)(0x42DE0580UL))
#define bFM4_GPIO_PFRB_P0                         *((volatile  uint8_t *)(0x42DE0580UL))
#define bFM_GPIO_PFRB_P1                          *((volatile  uint8_t *)(0x42DE0584UL))
#define bFM4_GPIO_PFRB_P1                         *((volatile  uint8_t *)(0x42DE0584UL))
#define bFM_GPIO_PFRB_P2                          *((volatile  uint8_t *)(0x42DE0588UL))
#define bFM4_GPIO_PFRB_P2                         *((volatile  uint8_t *)(0x42DE0588UL))
#define bFM_GPIO_PFRB_P3                          *((volatile  uint8_t *)(0x42DE058CUL))
#define bFM4_GPIO_PFRB_P3                         *((volatile  uint8_t *)(0x42DE058CUL))
#define bFM_GPIO_PFRB_P4                          *((volatile  uint8_t *)(0x42DE0590UL))
#define bFM4_GPIO_PFRB_P4                         *((volatile  uint8_t *)(0x42DE0590UL))
#define bFM_GPIO_PFRB_P5                          *((volatile  uint8_t *)(0x42DE0594UL))
#define bFM4_GPIO_PFRB_P5                         *((volatile  uint8_t *)(0x42DE0594UL))
#define bFM_GPIO_PFRB_P6                          *((volatile  uint8_t *)(0x42DE0598UL))
#define bFM4_GPIO_PFRB_P6                         *((volatile  uint8_t *)(0x42DE0598UL))
#define bFM_GPIO_PFRB_P7                          *((volatile  uint8_t *)(0x42DE059CUL))
#define bFM4_GPIO_PFRB_P7                         *((volatile  uint8_t *)(0x42DE059CUL))
#define bFM_GPIO_PFRB_P8                          *((volatile  uint8_t *)(0x42DE05A0UL))
#define bFM4_GPIO_PFRB_P8                         *((volatile  uint8_t *)(0x42DE05A0UL))
#define bFM_GPIO_PFRB_P9                          *((volatile  uint8_t *)(0x42DE05A4UL))
#define bFM4_GPIO_PFRB_P9                         *((volatile  uint8_t *)(0x42DE05A4UL))
#define bFM_GPIO_PFRB_PA                          *((volatile  uint8_t *)(0x42DE05A8UL))
#define bFM4_GPIO_PFRB_PA                         *((volatile  uint8_t *)(0x42DE05A8UL))
#define bFM_GPIO_PFRB_PB                          *((volatile  uint8_t *)(0x42DE05ACUL))
#define bFM4_GPIO_PFRB_PB                         *((volatile  uint8_t *)(0x42DE05ACUL))
#define bFM_GPIO_PFRB_PC                          *((volatile  uint8_t *)(0x42DE05B0UL))
#define bFM4_GPIO_PFRB_PC                         *((volatile  uint8_t *)(0x42DE05B0UL))
#define bFM_GPIO_PFRB_PD                          *((volatile  uint8_t *)(0x42DE05B4UL))
#define bFM4_GPIO_PFRB_PD                         *((volatile  uint8_t *)(0x42DE05B4UL))

