mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xj/common/s6e2d5xj.h
#define bFM_GPIO_PZRE_P0                          *((volatile  uint8_t *)(0x42DEE700UL))
#define bFM4_GPIO_PZRE_P0                         *((volatile  uint8_t *)(0x42DEE700UL))
#define bFM_GPIO_PZRE_P2                          *((volatile  uint8_t *)(0x42DEE708UL))
#define bFM4_GPIO_PZRE_P2                         *((volatile  uint8_t *)(0x42DEE708UL))
#define bFM_GPIO_PZRE_P3                          *((volatile  uint8_t *)(0x42DEE70CUL))
#define bFM4_GPIO_PZRE_P3                         *((volatile  uint8_t *)(0x42DEE70CUL))

#define bFM_GPIO_SPSR_USB0C                       *((volatile  uint8_t *)(0x42DEB010UL))
#define bFM4_GPIO_SPSR_USB0C                      *((volatile  uint8_t *)(0x42DEB010UL))
#define bFM_GPIO_SPSR_USB1C                       *((volatile  uint8_t *)(0x42DEB014UL))
#define bFM4_GPIO_SPSR_USB1C                      *((volatile  uint8_t *)(0x42DEB014UL))


/*******************************************************************************
* HSSPI Registers HSSPI
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* HWWDT Registers HWWDT
*   Bitband Section
*******************************************************************************/
#define bFM_HWWDT_WDG_CTL_INTEN                   *((volatile  uint32_t*)(0x42220100UL))
#define bFM4_HWWDT_WDG_CTL_INTEN                  *((volatile  uint32_t*)(0x42220100UL))
#define bFM_HWWDT_WDG_CTL_RESEN                   *((volatile  uint32_t*)(0x42220104UL))
#define bFM4_HWWDT_WDG_CTL_RESEN                  *((volatile  uint32_t*)(0x42220104UL))

#define bFM_HWWDT_WDG_RIS_RIS                     *((volatile  uint32_t*)(0x42220200UL))
#define bFM4_HWWDT_WDG_RIS_RIS                    *((volatile  uint32_t*)(0x42220200UL))


/*******************************************************************************
* HYPERBUS Registers HYPERBUS
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* I2S Registers I2S0
*   Bitband Section
*******************************************************************************/
#define bFM_I2S0_CNTREG_FSPL                      *((volatile  uint8_t *)(0x42D80100UL))
#define bFM4_I2S0_CNTREG_FSPL                     *((volatile  uint8_t *)(0x42D80100UL))
#define bFM_I2S0_CNTREG_FSLN                      *((volatile  uint8_t *)(0x42D80104UL))
#define bFM4_I2S0_CNTREG_FSLN                     *((volatile  uint8_t *)(0x42D80104UL))
#define bFM_I2S0_CNTREG_FSPH                      *((volatile  uint8_t *)(0x42D80108UL))
#define bFM4_I2S0_CNTREG_FSPH                     *((volatile  uint8_t *)(0x42D80108UL))
#define bFM_I2S0_CNTREG_CPOL                      *((volatile  uint8_t *)(0x42D8010CUL))
#define bFM4_I2S0_CNTREG_CPOL                     *((volatile  uint8_t *)(0x42D8010CUL))
#define bFM_I2S0_CNTREG_SMPL                      *((volatile  uint8_t *)(0x42D80110UL))
#define bFM4_I2S0_CNTREG_SMPL                     *((volatile  uint8_t *)(0x42D80110UL))
#define bFM_I2S0_CNTREG_RXDIS                     *((volatile  uint8_t *)(0x42D80114UL))
#define bFM4_I2S0_CNTREG_RXDIS                    *((volatile  uint8_t *)(0x42D80114UL))
#define bFM_I2S0_CNTREG_TXDIS                     *((volatile  uint8_t *)(0x42D80118UL))
#define bFM4_I2S0_CNTREG_TXDIS                    *((volatile  uint8_t *)(0x42D80118UL))
#define bFM_I2S0_CNTREG_MLSB                      *((volatile  uint8_t *)(0x42D8011CUL))
#define bFM4_I2S0_CNTREG_MLSB                     *((volatile  uint8_t *)(0x42D8011CUL))
#define bFM_I2S0_CNTREG_FRUN                      *((volatile  uint8_t *)(0x42D80120UL))
#define bFM4_I2S0_CNTREG_FRUN                     *((volatile  uint8_t *)(0x42D80120UL))
#define bFM_I2S0_CNTREG_BEXT                      *((volatile  uint8_t *)(0x42D80124UL))
#define bFM4_I2S0_CNTREG_BEXT                     *((volatile  uint8_t *)(0x42D80124UL))
#define bFM_I2S0_CNTREG_ECKM                      *((volatile  uint8_t *)(0x42D80128UL))
#define bFM4_I2S0_CNTREG_ECKM                     *((volatile  uint8_t *)(0x42D80128UL))
#define bFM_I2S0_CNTREG_RHLL                      *((volatile  uint8_t *)(0x42D8012CUL))
#define bFM4_I2S0_CNTREG_RHLL                     *((volatile  uint8_t *)(0x42D8012CUL))
#define bFM_I2S0_CNTREG_SBFN                      *((volatile  uint8_t *)(0x42D80130UL))
#define bFM4_I2S0_CNTREG_SBFN                     *((volatile  uint8_t *)(0x42D80130UL))
#define bFM_I2S0_CNTREG_MSMD                      *((volatile  uint8_t *)(0x42D80134UL))
#define bFM4_I2S0_CNTREG_MSMD                     *((volatile  uint8_t *)(0x42D80134UL))
#define bFM_I2S0_CNTREG_MSKB                      *((volatile  uint8_t *)(0x42D80138UL))
#define bFM4_I2S0_CNTREG_MSKB                     *((volatile  uint8_t *)(0x42D80138UL))

#define bFM_I2S0_DMAACT_RDMACT                    *((volatile  uint8_t *)(0x42D80500UL))
#define bFM4_I2S0_DMAACT_RDMACT                   *((volatile  uint8_t *)(0x42D80500UL))
#define bFM_I2S0_DMAACT_RL1E0                     *((volatile  uint8_t *)(0x42D80520UL))
#define bFM4_I2S0_DMAACT_RL1E0                    *((volatile  uint8_t *)(0x42D80520UL))
#define bFM_I2S0_DMAACT_TDMACT                    *((volatile  uint8_t *)(0x42D80540UL))
#define bFM4_I2S0_DMAACT_TDMACT                   *((volatile  uint8_t *)(0x42D80540UL))
#define bFM_I2S0_DMAACT_TL1E0                     *((volatile  uint8_t *)(0x42D80560UL))
#define bFM4_I2S0_DMAACT_TL1E0                    *((volatile  uint8_t *)(0x42D80560UL))

#define bFM_I2S0_INTCNT_RXFIM                     *((volatile  uint8_t *)(0x42D80440UL))
#define bFM4_I2S0_INTCNT_RXFIM                    *((volatile  uint8_t *)(0x42D80440UL))
#define bFM_I2S0_INTCNT_RXFDM                     *((volatile  uint8_t *)(0x42D80444UL))
#define bFM4_I2S0_INTCNT_RXFDM                    *((volatile  uint8_t *)(0x42D80444UL))
#define bFM_I2S0_INTCNT_EOPM                      *((volatile  uint8_t *)(0x42D80448UL))
#define bFM4_I2S0_INTCNT_EOPM                     *((volatile  uint8_t *)(0x42D80448UL))
#define bFM_I2S0_INTCNT_RXOVM                     *((volatile  uint8_t *)(0x42D8044CUL))
#define bFM4_I2S0_INTCNT_RXOVM                    *((volatile  uint8_t *)(0x42D8044CUL))
#define bFM_I2S0_INTCNT_RXUDM                     *((volatile  uint8_t *)(0x42D80450UL))
#define bFM4_I2S0_INTCNT_RXUDM                    *((volatile  uint8_t *)(0x42D80450UL))
#define bFM_I2S0_INTCNT_RBERM                     *((volatile  uint8_t *)(0x42D80454UL))
#define bFM4_I2S0_INTCNT_RBERM                    *((volatile  uint8_t *)(0x42D80454UL))
#define bFM_I2S0_INTCNT_TXFIM                     *((volatile  uint8_t *)(0x42D80460UL))
#define bFM4_I2S0_INTCNT_TXFIM                    *((volatile  uint8_t *)(0x42D80460UL))
#define bFM_I2S0_INTCNT_TXFDM                     *((volatile  uint8_t *)(0x42D80464UL))
#define bFM4_I2S0_INTCNT_TXFDM                    *((volatile  uint8_t *)(0x42D80464UL))
#define bFM_I2S0_INTCNT_TXOVM                     *((volatile  uint8_t *)(0x42D80468UL))
#define bFM4_I2S0_INTCNT_TXOVM                    *((volatile  uint8_t *)(0x42D80468UL))
#define bFM_I2S0_INTCNT_TXUD0M                    *((volatile  uint8_t *)(0x42D8046CUL))
#define bFM4_I2S0_INTCNT_TXUD0M                   *((volatile  uint8_t *)(0x42D8046CUL))
#define bFM_I2S0_INTCNT_FERRM                     *((volatile  uint8_t *)(0x42D80470UL))
#define bFM4_I2S0_INTCNT_FERRM                    *((volatile  uint8_t *)(0x42D80470UL))
#define bFM_I2S0_INTCNT_TBERM                     *((volatile  uint8_t *)(0x42D80474UL))
#define bFM4_I2S0_INTCNT_TBERM                    *((volatile  uint8_t *)(0x42D80474UL))
#define bFM_I2S0_INTCNT_TXUD1M                    *((volatile  uint8_t *)(0x42D80478UL))
#define bFM4_I2S0_INTCNT_TXUD1M                   *((volatile  uint8_t *)(0x42D80478UL))

